sheulisback/ble-demo-wb05kn1-nucleo-u545/firmware/Middlewares/ST/STM32WB05N/includes/stm32wb05n_hci_le.h
/**
  ******************************************************************************
  * @file    stm32wb05n_hci_le.h
  * @author  System Research & Applications Team - Agrate/Catania Lab.
  * @version V1.3.0
  * @date    06-Feb-2024
  * @brief   Header file for external uC - STM32WB05N in network coprocessor mode (hci_le)
  *          Autogenerated files, do not edit!!
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2024 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */

#ifndef _STM32WB05N_HCI_LE_H_
#define _STM32WB05N_HCI_LE_H_

#include "ble_types.h"
#include "stm32wb05n_types.h"
/** Documentation for C struct Advertising_Set_Parameters_t */
typedef struct Advertising_Set_Parameters_t_s {
  /** It is used to identify an advertising set.
   *  Values:
   *  - 0x00 ... 0xEF
   */
  uint8_t Advertising_Handle;
  /** The Duration[i] parameter indicates the duration for which that advertising set
   *  is enabled. The duration begins at the start of the first advertising
   *  event of this advertising set. The Controller should not start an extended
   *  advertising event that it cannot complete within the duration. Time = N *
   *  10 ms 0x00 means no advertising duration: advertising will continue until
   *  the Host disables it.
   *  Values:
   *  - 0x0000 (0 ms) : No advertising duration
   *  - 0x0001 (10 ms)  ... 0xFFFF (655350 ms) 
   */
  uint16_t Duration;
  /** The Max_Extended_Advertising_Events[i] parameter, if non-zero, indicates the
   *  maximum number of extended advertising events that shall be sent prior to
   *  disabling the extended advertising set even if the Duration[i] parameter
   *  has not expired.
   *  Values:
   *  - 0x00: No maximum number of advertising events.
   *  - 0x01 ... 0xFF: Maximum number of extended advertising events.
   */
  uint8_t Max_Extended_Advertising_Events;
} Advertising_Set_Parameters_t;

/** Documentation for C struct Extended_Scan_Parameters_t */
typedef struct Extended_Scan_Parameters_t_s {
  /** The Scan_Type parameter specifies the type of scan to perform. 0: Passive
   *  Scanning. No scan request PDUs shall be sent. 1: Active Scanning. Scan
   *  request PDUs may be sent.
   *  Values:
   *  - 0x00: Passive Scanning
   *  - 0x01: Active Scanning
   */
  uint8_t Scan_Type;
  /** Time interval from when the Controller started its last scan until it begins the
   *  subsequent scan on the primary advertising channel.  Time = N * 0.625 ms
   *  Values:
   *  - 0x0004 (2.500 ms)  ... 0xFFFF (40959.375 ms) 
   */
  uint16_t Scan_Interval;
  /** Duration of the scan on the primary advertising channel.  Time = N * 0.625 ms
   *  Values:
   *  - 0x0004 (2.500 ms)  ... 0xFFFF (40959.375 ms) 
   */
  uint16_t Scan_Window;
} Extended_Scan_Parameters_t;

/** Documentation for C struct Extended_Create_Connection_Parameters_t */
typedef struct Extended_Create_Connection_Parameters_t_s {
  /** Time interval from when the Controller started its last scan until it begins the
   *  subsequent scan on the primary advertising channel. Time = N * 0.625 ms;
   *  Time Range: 2.5 ms to 40.959375 s.
   *  Values:
   *  - 0x0004 (2.500 ms)  ... 0xFFFF (40959.375 ms) 
   */
  uint16_t Scan_Interval;
  /** Duration of the scan on the primary advertising channel. Time = N * 0.625 ms;
   *  Time Range: 2.5 ms to 40.959375 s.
   *  Values:
   *  - 0x0004 (2.500 ms)  ... 0xFFFF (40959.375 ms) 
   */
  uint16_t Scan_Window;
  /** Minimum value for the connection interval. This shall be less than or equal to
   *  Connection_Interval_Max[i]. Time = N * 1.25 ms; Time Range: 7.5 ms to 4 s.
   *  Values:
   *  - 0x0006 (7.50 ms)  ... 0x0C80 (4000.00 ms) 
   */
  uint16_t Connection_Interval_Min;
  /** Maximum value for the connection interval. This shall be less than or equal to
   *  Connection_Interval_Max[i]. Time = N * 1.25 ms; Time Range: 7.5 ms to 4 s.
   *  Values:
   *  - 0x0006 (7.50 ms)  ... 0x0C80 (4000.00 ms) 
   */
  uint16_t Connection_Interval_Max;
  /** Peripheral latency for the connection in number of connection events
   *  Values:
   *  - 0x0000 ... 0x01F3
   */
  uint16_t Max_Latency;
  /** Supervision timeout for the LE Link. (See [Vol 6] Part B, Section 4.5.2) Time =
   *  N * 10 ms; Time Range: 100 ms to 32 s.
   *  Values:
   *  - 0x000A (100 ms)  ... 0x0C80 (32000 ms) 
   */
  uint16_t Supervision_Timeout;
  /** Informative parameter recommending the minimum length of connection event needed
   *  for this LE connection. Time = N * 0.625 ms.
   *  Values:
   *  - 0x0000 (0.000 ms)  ... 0xFFFF (40959.375 ms) 
   */
  uint16_t Min_CE_Length;
  /** Informative parameter recommending the maximum length of connection event needed
   *  for this LE connection. Time = N * 0.625 ms.
   *  Values:
   *  - 0x0000 (0.000 ms)  ... 0xFFFF (40959.375 ms) 
   */
  uint16_t Max_CE_Length;
} Extended_Create_Connection_Parameters_t;

/** Documentation for C struct CIS_Param_t */
typedef struct CIS_Param_t_s {
  /** Used to identify a CIS.
   *  Values:
   *  - 0x00 ... 0xEF
   */
  uint8_t CIS_ID;
  /** Maximum size, in octets, of the payload from the Central's Host.
   *  Values:
   *  - 0x0000 ... 0x0FFF
   */
  uint16_t Max_SDU_C_To_P;
  /** Maximum size, in octets, of the payload from the Peripheral's Host.
   *  Values:
   *  - 0x0000 ... 0x0FFF
   */
  uint16_t Max_SDU_P_To_C;
  /** PHY to use for transmission from the Central to the Peripheral.
   *  Flags:
   *  - 0x01: LE_1M_PHY_BIT
   *  - 0x02: LE_2M_PHY_BIT
   *  - 0x04: LE_CODED_PHY_BIT
   */
  uint8_t PHY_C_To_P;
  /** PHY to use for transmission from the Peripheral to the Central.
   *  Flags:
   *  - 0x01: LE_1M_PHY_BIT
   *  - 0x02: LE_2M_PHY_BIT
   *  - 0x04: LE_CODED_PHY_BIT
   */
  uint8_t PHY_P_To_C;
  /** Number of times every CIS Data PDU should be retransmitted from the Central to
   *  the Peripheral.
   */
  uint8_t RTN_C_To_P;
  /** Number of times every CIS Data PDU should be retransmitted from the Peripheral
   *  to the Central.
   */
  uint8_t RTN_P_To_C;
} CIS_Param_t;

/** Documentation for C struct CIS_Param_Test_t */
typedef struct CIS_Param_Test_t_s {
  /** Used to identify a CIS.
   *  Values:
   *  - 0x00 ... 0xEF
   */
  uint8_t CIS_ID;
  /** Maximum number of subevents in each CIS event.
   *  Values:
   *  - 0x01 ... 0x1F
   */
  uint8_t NSE;
  /** Maximum size, in octets, of the payload from the Central's Host.
   *  Values:
   *  - 0x0000 ... 0x0FFF
   */
  uint16_t Max_SDU_C_To_P;
  /** Maximum size, in octets, of the payload from the Peripheral's Host.
   *  Values:
   *  - 0x0000 ... 0x0FFF
   */
  uint16_t Max_SDU_P_To_C;
  /** Maximum size, in octets, of the payload from the Central's Link Layer to the
   *  Peripheral's Link Layer.
   *  Values:
   *  - 0x0000 ... 0x00FB
   */
  uint16_t Max_PDU_C_To_P;
  /** Maximum size, in octets, of the payload from the Peripheral's Link Layer to the
   *  Central's Link Layer.
   *  Values:
   *  - 0x0000 ... 0x00FB
   */
  uint16_t Max_PDU_P_To_C;
  /** PHY to use for transmission from the Central to the Peripheral.
   *  Flags:
   *  - 0x01: LE_1M_PHY_BIT
   *  - 0x02: LE_2M_PHY_BIT
   *  - 0x04: LE_CODED_PHY_BIT
   */
  uint8_t PHY_C_To_P;
  /** PHY to use for transmission from the Peripheral to the Central.
   *  Flags:
   *  - 0x01: LE_1M_PHY_BIT
   *  - 0x02: LE_2M_PHY_BIT
   *  - 0x04: LE_CODED_PHY_BIT
   */
  uint8_t PHY_P_To_C;
  /** The burst number for Central to Peripheral.
   *  Values:
   *  - 0x00: No data
   *  - 0x01 ... 0x0F
   */
  uint8_t BN_C_To_P;
  /** The burst number for Peripheral to Central.
   *  Values:
   *  - 0x00: No data
   *  - 0x01 ... 0x0F
   */
  uint8_t BN_P_To_C;
} CIS_Param_Test_t;

/** Documentation for C struct CIS_Handles_t */
typedef struct CIS_Handles_t_s {
  /** Connection handle of a CIS.
   *  Values:
   *  - 0x0000 ... 0x0EFF
   */
  uint16_t CIS_Connection_Handle;
  /** Connection handle of an ACL connection.
   *  Values:
   *  - 0x0000 ... 0x0EFF
   */
  uint16_t ACL_Connection_Handle;
} CIS_Handles_t;

