sheulisback/ble-demo-wb05kn1-nucleo-u545/firmware/Middlewares/ST/STM32WB05N/includes/stm32wb05n_hci_le.h
 *        Values:
 *        - 0x00: Public Device Address
 *        - 0x01: Random Device Address
 *        - 0x02: Resolvable Private Address / Public Address
 *        - 0x03: Resolvable Private Address / Random Address
 * @param Peer_Address_Type Peer Address type
 *        Values:
 *        - 0x00: Public Device Address or Public Identity Address
 *        - 0x01: Random Device Address or Random (static) Identity Address
 * @param Peer_Address Public Device Address, Random Device Address, Public
 *        Identity Address, or Random (static) Identity Address of the device to
 *        be connected.
 * @param Advertising_Filter_Policy Advertising Filter Policy. This parameter is
 *        ignored when directed advertising is enabled.  0x00 Process scan and
 *        connection requests from all devices (i.e., the Filter Accept List is
 *        not in use) 0x01 Process connection requests from all devices and scan
 *        requests only from devices that are in the Filter Accept List 0x02
 *        Process scan requests from all devices and connection requests only
 *        from devices that are in the Filter Accept List. 0x03 Process scan and
 *        connection requests only from devices in the Filter Accept List. All
 *        other values are reserved for future use
 *        Values:
 *        - 0x00: HCI_ADV_FILTER_NONE
 *        - 0x01: HCI_ADV_FILTER_ACCEPT_LIST_SCAN
 *        - 0x02: HCI_ADV_FILTER_ACCEPT_LIST_CONNECT
 *        - 0x03: HCI_ADV_FILTER_ACCEPT_LIST_SCAN_CONNECT
 * @param Advertising_Tx_Power Units: dBm  The Advertising_Tx_Power parameter
 *        indicates the maximum power level at which the advertising packets are
 *        to be transmitted on the advertising channels. The Controller shall
 *        choose a power level lower than or equal to the one specified by the
 *        Host.
 *        Values:
 *        - -127 ... 126
 *        - 127: No preference
 * @param Primary_Advertising_PHY The Primary_Advertising_PHY parameter
 *        indicates the PHY on which the advertising packets are transmitted on
 *        the primary advertising channel. If legacy advertising PDUs are being
 *        used, the Primary_Advertising_PHY shall indicate the LE 1M PHY.
 *        Values:
 *        - 0x01: LE_1M_PHY
 *        - 0x03: LE_CODED_PHY
 * @param Secondary_Advertising_Max_Skip The Secondary_Advertising_Max_Skip
 *        parameter is the maximum number of advertising events that can be
 *        skipped before the AUX_ADV_IND can be sent. 0x00 AUX_ADV_IND shall be
 *        sent prior to the next advertising event 0x01-0xFF Maximum advertising
 *        events the Controller can skip before sending the AUX_ADV_IND packets
 *        on the secondary advertising channel
 *        Values:
 *        - 0x00 ... 0xFF
 * @param Secondary_Advertising_PHY The Secondary_Advertising_PHY parameter
 *        indicates the PHY on which the advertising packets are transmitted on
 *        the secondary advertising channel.
 *        Values:
 *        - 0x01: LE_1M_PHY
 *        - 0x02: LE_2M_PHY
 *        - 0x03: LE_CODED_PHY
 * @param Advertising_SID The Advertising_SID parameter specifies the value to
 *        be transmitted in the Advertising SID subfield of the ADI field of the
 *        Extended Header of those advertising channel PDUs that have an ADI
 *        field. If the advertising set only uses PDUs that do not contain an
 *        ADI field, Advertising_SID is ignored.
 *        Values:
 *        - 0x00 ... 0x0F
 * @param Scan_Request_Notification_Enable The Scan_Request_Notification_Enable
 *        parameter indicates whether the Controller shall send notifications
 *        upon the receipt of a scan request PDU that is in response to an
 *        advertisement from the specified advertising set that contains its
 *        device address and is from a scanner that is allowed by the
 *        advertising filter policy.
 *        Values:
 *        - 0x00: Scan request notifications disabled
 *        - 0x01: Scan request notifications enabled
 * @param[out] Selected_Tx_Power Units: dBm. The Selected_Tx_Power return
 *             parameter indicates the transmit power selected by the
 *             Controller. The Controller shall not change the transmit power
 *             for this advertising set without being directed to by the Host.
 *             Values:
 *             - -127 ... 126
 * @retval Value indicating success or error code.
 */
tBleStatus hci_le_set_extended_advertising_parameters(uint8_t Advertising_Handle,
                                                      uint16_t Advertising_Event_Properties,
                                                      uint8_t Primary_Advertising_Interval_Min[3],
                                                      uint8_t Primary_Advertising_Interval_Max[3],
                                                      uint8_t Primary_Advertising_Channel_Map,
                                                      uint8_t Own_Address_Type,
                                                      uint8_t Peer_Address_Type,
                                                      uint8_t Peer_Address[6],
                                                      uint8_t Advertising_Filter_Policy,
                                                      int8_t Advertising_Tx_Power,
                                                      uint8_t Primary_Advertising_PHY,
                                                      uint8_t Secondary_Advertising_Max_Skip,
                                                      uint8_t Secondary_Advertising_PHY,
                                                      uint8_t Advertising_SID,
                                                      uint8_t Scan_Request_Notification_Enable,
                                                      int8_t *Selected_Tx_Power);
/**
 * @brief The LE_Set_Extended_Advertising_Data command is used to set the data
 *        used in advertising PDUs that have a data field. This command may be
 *        issued at any time after an advertising set identified by the
 *        Advertising_Handle parameter has been created using the LE Set
 *        Extended Advertising Parameters Command (see Section 7.8.53),
 *        regardless of whether advertising in that set is enabled or disabled.
 * @param Advertising_Handle It is used to identify an advertising set
 *        Values:
 *        - 0x00 ... 0xEF
 * @param Operation The Host may set the advertising data in one or more
 *        operations using this parameter. 0x00: Intermediate fragment of
 *        fragmented extended advertising data 0x01: First fragment of
 *        fragmented extended advertising data 0x02: Last fragment of fragmented
 *        extended advertising data 0x03: Complete extended advertising data
 *        0x04: Unchanged data (just update the Advertising DID) All other
 *        values: Reserved for future use
 *        Values:
 *        - 0x00: Intermediate fragment
 *        - 0x01: First fragment
 *        - 0x02: Last fragment
 *        - 0x03: Complete data
 *        - 0x04: Unchanged data
 * @param Fragment_Preference The Fragment_Preference parameter provides a hint
 *        to the Controller as to whether advertising data should be fragmented.
 *        Values:
 *        - 0x00: The Controller may fragment
 *        - 0x01: The Controller should not fragment or should minimize fragmentation
 * @param Advertising_Data_Length The number of octets in the Advertising Data
 *        parameter
 *        Values:
 *        - 0 ... 251
 * @param Advertising_Data Advertising data formatted as defined in [Vol 3] Part
 *        C, Section 11 Note: This parameter has a variable length.
 * @retval Value indicating success or error code.
 */
tBleStatus hci_le_set_extended_advertising_data(uint8_t Advertising_Handle,
                                                uint8_t Operation,
                                                uint8_t Fragment_Preference,
                                                uint8_t Advertising_Data_Length,
                                                uint8_t Advertising_Data[]);
/**
 * @brief The LE_Set_Extended_Scan_Response_Data command is used to provide scan
 *        response data used in scanning response PDUs. This command may be
 *        issued at any time after the advertising set identified by the
 *        Advertising_Handle parameter has been created using the LE Set
 *        Extended Advertising Parameters Command (see Section 7.8.53)
 *        regardless of whether advertising in that set is enabled or disabled.
 * @param Advertising_Handle It is used to identify an advertising set
 *        Values:
 *        - 0x00 ... 0xEF: Used to identify an advertising set
 * @param Operation The Host may set the scan response data in one or more
 *        operations using the Operation parameter in the command. 0x00:
 *        Intermediate fragment of fragmented scan response data 0x01: First
 *        fragment of fragmented scan response data 0x02: Last fragment of
 *        fragmented scan response data 0x03: Complete scan response data All
 *        other values: Reserved for future use
 *        Values:
 *        - 0x00: Intermediate fragment
 *        - 0x01: First fragment
 *        - 0x02: Last fragment
 *        - 0x03: Complete data
 * @param Fragment_Preference The Fragment_Preference parameter provides a hint
 *        to the Controller as to whether advertising data should be fragmented.
 *        Values:
 *        - 0x00: The Controller may fragment all scan response data
 *        - 0x01: The Controller should not fragment or should minimize fragmentation of
scan response data
 * @param Scan_Response_Data_Length The number of octets in the Scan_Response
 *        Data parameter
 *        Values:
 *        - 0x00 ... 0xFB: The number of octets in the Scan_Response Data parameter
 * @param Scan_Response_Data Scan response data formatted as defined in [Vol 3]
 *        Part C, Section 11 Note: This parameter has a variable length.
 * @retval Value indicating success or error code.
 */
tBleStatus hci_le_set_extended_scan_response_data(uint8_t Advertising_Handle,
                                                  uint8_t Operation,
                                                  uint8_t Fragment_Preference,
                                                  uint8_t Scan_Response_Data_Length,
                                                  uint8_t Scan_Response_Data[]);
/**
 * @brief The LE_Set_Extended_Advertising_Enable command is used to request the
 *        Controller to enable or disable one or more advertising sets using the
 *        advertising sets identified by the Advertising_Handle[i] parameter.
 *        The Controller manages the timing of advertisements in accordance with
 *        the advertising parameters given in the
 *        LE_Set_Extended_Advertising_Parameters command.
 * @param Enable It allows to enable or disable one or more advertising sets
 *        using the advertising sets identified by the Advertising_Handle[i]
 *        parameter.
 *        Values:
 *        - 0x00: Disable
 *        - 0x01: Enable
 * @param Number_of_Sets The Number_of_Sets parameter is the number of
 *        advertising sets contained in the parameter arrays.
 *        Values:
 *        - 0x00: Disable all advertising sets
 *        - 0x01 ... 0x3F: Number of advertising sets to enable or disable
 * @param Advertising_Set_Parameters See @ref Advertising_Set_Parameters_t
 * @retval Value indicating success or error code.
 */
tBleStatus hci_le_set_extended_advertising_enable(uint8_t Enable,
                                                  uint8_t Number_of_Sets,
                                                  Advertising_Set_Parameters_t Advertising_Set_Parameters[]);
/**
 * @brief The LE_Read_Maximum_Advertising_Data_Length command is used to read
 *        the maximum length of data supported by the Controller for use as
 *        advertisement data or scan response data in an advertising event or as
 *        periodic advertisement data. Note: The maximum amount may be
 *        fragmented across multiple PDUs (see [Vol 6] Part B, Section 2.3.4.9).
 * @param[out] Maximum_Advertising_Data_Length Maximum length of data supported
 *             by the Controller for use as advertisement data or scan response
 *             data in an advertising event or as periodic advertisement data.
 *             Values:
 *             - 0x001F ... 0x0672: Maximum supported advertising data length
 * @retval Value indicating success or error code.
 */
tBleStatus hci_le_read_maximum_advertising_data_length(uint16_t *Maximum_Advertising_Data_Length);
/**
 * @brief The LE_Read_Number_of_Supported_Advertising_Sets command is used to
 *        read the maximum number of advertising sets supported by the
 *        advertising Controller at the same time. Note: The number of
 *        advertising sets that can be supported is not fixed and the Controller
 *        can change it at any time because the memory used to store advertising
 *        sets can also be used for other purposes.
 * @param[out] Num_Supported_Advertising_Sets Maximum number of advertising sets
 *             supported by the advertising Controller at the same time.
 *             Values:
 *             - 0x01 ... 0xF0: Number of advertising sets supported at the same time
 * @retval Value indicating success or error code.
 */
tBleStatus hci_le_read_number_of_supported_advertising_sets(uint8_t *Num_Supported_Advertising_Sets);
/**
 * @brief The LE_Remove_Advertising_Set command is used to remove an advertising
 *        set from the Controller. If the advertising set corresponding to the
 *        Advertising_Handle parameter does not exist, then the Controller shall
 *        return the error code Unknown Advertising Identifier (0x42). If
 *        advertising on the advertising set is enabled, then the Controller
 *        shall return the error code Command Disallowed (0x0C).
 * @param Advertising_Handle It is used to identify an advertising set
 *        Values:
 *        - 0x00 ... 0xEF: Used to identify an advertising set
 * @retval Value indicating success or error code.
 */
tBleStatus hci_le_remove_advertising_set(uint8_t Advertising_Handle);
/**
 * @brief The LE_Clear_Advertising_Sets command is used to remove all existing
 *        advertising sets from the Controller. If advertising is enabled on any
 *        advertising set, then the Controller shall return the error code
 *        Command Disallowed (0x0C). Note: All advertising sets are cleared on
 *        HCI reset.
 * @retval Value indicating success or error code.
 */
tBleStatus hci_le_clear_advertising_sets(void);
/**
 * @brief The LE_Set_Periodic_Advertising_Parameters command is used by the Host
 *        to set the parameters for periodic advertising. The Advertising_Handle
 *        parameter identifies the advertising set whose periodic advertising
 *        parameters are being configured. If the corresponding advertising set
 *        does not already exist, then the Controller shall return the error
 *        code Unknown Advertising Identifier (0x42). The
 *        Periodic_Advertising_Interval_Min parameter shall be less than or
 *        equal to the Periodic_Advertising_Interval_Max parameter. The
 *        Periodic_Advertising_Interval_Min and
 *        Periodic_Advertising_Interval_Max parameters should not be the same
 *        value to enable the Controller to determine the best advertising
 *        interval given other activities. The Periodic_Advertising_Properties
 *        parameter indicates which fields should be included in the advertising
 *        packet. If the advertising set identified by the Advertising_Handle
 *        specified anonymous advertising, the Controller shall return the error
 *        code Invalid HCI Parameters (0x12). If the Host issues this command
 *        when periodic advertising is enabled for the specified advertising
 *        set, the Controller shall return the error code Command Disallowed
 *        (0x0C). If the Advertising_Handle does not identify an advertising set
 *        that is already configured for periodic advertising and the Controller
 *        is unable to support more periodic advertising at present, the
 *        Controller shall return the error code Memory Capacity Exceeded (0x07)
 * @param Advertising_Handle It is used to identify an advertising set
 *        Values:
 *        - 0x00 ... 0xEF: Used to identify a periodic advertisement
 * @param Periodic_Advertising_Interval_Min Minimum advertising interval for
 *        periodic advertising. Time = N * 1.25 ms; Time Range: 7.5ms to
 *        81.91875 s.
 *        Values:
 *        - 0x0006 (7.50 ms)  ... 0xFFFF (NaN) 
 * @param Periodic_Advertising_Interval_Max Maximum advertising interval for
 *        periodic advertising. Time = N * 1.25 ms; Time Range: 7.5ms to
 *        81.91875 s.
 *        Values:
 *        - 0x0006 (7.50 ms)  ... 0xFFFF (NaN) 
 * @param Periodic_Advertising_Properties The Periodic_Advertising_Properties
 *        parameter indicates which fields should be included in the advertising
 *        packet.
 *        Flags:
 *        - 0x0040: Include TxPower in the advertising PDU
 * @retval Value indicating success or error code.
 */
tBleStatus hci_le_set_periodic_advertising_parameters(uint8_t Advertising_Handle,
                                                      uint16_t Periodic_Advertising_Interval_Min,
                                                      uint16_t Periodic_Advertising_Interval_Max,
                                                      uint16_t Periodic_Advertising_Properties);
/**
 * @brief The LE_Set_Periodic_Advertising_Data command is used to set the data
 *        used in periodic advertising PDUs. This command may be issued at any
 *        time after the advertising set identified by the Advertising_Handle
 *        parameter has been configured for periodic advertising using the
 *        LE_Set_Periodic_Advertising_Parameters Command (see Section 7.8.61),
 *        regardless of whether advertising in that set is enabled or disabled.
 *        If the advertising set has not been configured for periodic
 *        advertising, then the Controller shall return the error code Command
 *        Disallowed (0x0C). If advertising is currently enabled for the
 *        specified advertising set, the Controller shall use the new data in
 *        subsequent periodic advertising events for this advertising set. If a
 *        periodic advertising event is in progress when this command is issued,
 *        the Controller may use the old or new data for that event. If periodic
 *        advertising is currently disabled for the specified advertising set,
 *        the data shall be kept by the Controller and used once periodic
 *        advertising is enabled for that set. The data shall be discarded when
 *        the advertising set is removed. Only the significant part of the
 *        periodic advertising data should be transmitted in the advertising
 *        packets as defined in [Vol 3] Part C, Section 11. The Host may set the
 *        periodic advertising data in one or more operations using the
 *        Operation parameter in the command. If the combined length of the data
 *        exceeds the capacity of the advertising set identified by the
 *        Advertising_Handle parameter (see Section 7.8.57 LE Read Maximum
 *        Advertising Data Length Command) or the amount of memory currently
 *        available, all the data shall be discarded and the Controller shall
 *        return the error code Memory Capacity Exceeded (0x07). If Operation
 *        indicates the start of new data (values 0x01 or 0x03), then any
 *        existing partial or complete data shall be discarded. If the
 *        Advertising_Data_Length parameter is 0, then Operation shall be 0x03;
 *        this indicates that any existing partial or complete data shall be
 *        deleted and no new data provided.
 * @param Advertising_Handle It is used to identify an advertising set
 *        Values:
 *        - 0x00 ... 0xEF: Used to identify an advertising set
 * @param Operation The Host may set the periodic advertising data in one or
 *        more operations using the Operation parameter in the command.
 *        Values:
 *        - 0x00: Intermediate fragment of fragmented periodic advertising data
 *        - 0x01: First fragment of fragmented periodic advertising data
 *        - 0x02: Last fragment of fragmented periodic advertising data
 *        - 0x03: Complete periodic advertising data
 * @param Advertising_Data_Length The number of octets in the Advertising Data
 *        parameter
 *        Values:
 *        - 0 ... 252: The number of octets in the Advertising Data parameter
 * @param Advertising_Data Periodic advertising data formatted as defined in
 *        [Vol 3] Part C, Section 11. Note: This parameter has a variable
 *        length.
 * @retval Value indicating success or error code.
 */
tBleStatus hci_le_set_periodic_advertising_data(uint8_t Advertising_Handle,
                                                uint8_t Operation,
                                                uint8_t Advertising_Data_Length,
                                                uint8_t Advertising_Data[]);
/**
 * @brief The HCI_LE_Set_Periodic_Advertising_Enable command is used to request
 *        the Controller to enable or disable the periodic advertising for the
 *        advertising set specified by the Advertising_Handle parameter
 *        (ordinary advertising is not affected). If the advertising set is not
 *        currently enabled (see the HCI_LE_Set_Extended_Advertising_Enable
 *        command), the periodic advertising is not started until the
 *        advertising set is enabled. Once the advertising set has been enabled,
 *        the Controller shall continue periodic advertising until the Host
 *        issues an HCI_LE_Set_Periodic_Advertising_Enable command with bit 0 of
 *        Enable set to 0 (periodic advertising is disabled). Disabling the
 *        advertising set has no effect on the periodic advertising once the
 *        advertising set has been enabled. The Controller manages the timing of
 *        advertisements in accordance with the advertising parameters given in
 *        the HCI_LE_Set_Periodic_Advertising_Parameters command. If the
 *        advertising set corresponding to the Advertising_Handle parameter does
 *        not exist, the Controller shall return the error code Unknown
 *        Advertising Identifier (0x42). If bit 0 of Enable is set to 1
 *        (periodic advertising is enabled) and the advertising set contains
 *        partial periodic advertising data, the Controller shall return the
 *        error code Command Disallowed (0x0C). If bit 0 of Enable is set to 1
 *        and the Host has not issued the
 *        HCI_LE_Set_Periodic_Advertising_Parameters command for the advertising
 *        set, the Controller shall either use vendor-specified parameters or
 *        return the error code Command Disallowed (0x0C). If bit 0 of Enable is
 *        set to 1 and the length of the periodic advertising data is greater
 *        than the maximum that the Controller can transmit within the chosen
 *        periodic advertising interval, the Controller shall return the error
 *        code Packet Too Long (0x45). If advertising on the LE Coded PHY, the
 *        S=8 coding shall be assumed. If bit 0 of Enable is set to 1 and the
 *        advertising set identified by the Advertising_Handle specified
 *        scannable, connectable, legacy, or anonymous (0x0C). If bit 0 of
 *        Enable is set to 0 and the Controller supports the Periodic
 *        Advertising ADI Support feature, then the Controller shall ignore bit
