sheulisback/ble-demo-wb05kn1-nucleo-u545/firmware/Middlewares/ST/STM32WB05N/includes/stm32wb05n_hci_le.h
 *        Disallowed (0x0C). If the Connection_Handle parameter does not
 *        identify a current connection, the Controller shall return the error
 *        code Unknown Connection Identifier (0x02). If the remote device has
 *        not indicated support for the Periodic Advertising Sync Transfer -
 *        Recipient feature, the Controller shall return the error code
 *        Unsupported Remote Feature / Unsupported LMP Feature (0x1A). Note:
 *        This command may complete before the periodic advertising
 *        synchronization information is sent. No indication is given as to how
 *        the recipient handled the information.
 * @param Connection_Handle Connection handle that identifies the connection.
 *        Values:
 *        - 0x0000 ... 0x0EFF
 * @param Service_Data It is a value provided by the Host to identify the
 *        periodic advertising train to the peer device. It is not used by the
 *        Controller.
 * @param Advertising_Handle It is used to identify an advertising set
 *        Values:
 *        - 0x00 ... 0xEF
 * @retval Value indicating success or error code.
 */
tBleStatus hci_le_periodic_advertising_set_info_transfer(uint16_t Connection_Handle,
                                                         uint16_t Service_Data,
                                                         uint8_t Advertising_Handle);
/**
 * @brief The HCI_LE_Set_Periodic_Advertising_Sync_Transfer_Parameters command
 *        is used to specify how the Controller will process periodic
 *        advertising synchronization information received from the device
 *        identified by the Connection_Handle parameter (the "transfer mode").
 *        The Mode parameter specifies the action to be taken when periodic
 *        advertising synchronization information is received. If Mode is 0x00,
 *        the Controller will ignore the information. Otherwise it will notify
 *        the Host and synchronize to the periodic advertising. Mode also
 *        specifies whether periodic advertising reports are initially enabled
 *        or disabled and whether duplicates are filtered. The Skip parameter
 *        specifies the number of consecutive periodic advertising packets that
 *        the receiver may skip after successfully receiving a periodic
 *        advertising packet. The Sync_Timeout parameter specifies the maximum
 *        permitted time between successful receives. If this time is exceeded,
 *        synchronization is lost. Irrespective of the value of the Skip
 *        parameter, the Controller should stop skipping packets before the
 *        Sync_Timeout would be exceeded. The CTE_Type parameter specifies
 *        whether to only synchronize to periodic advertising with certain types
 *        of Constant Tone Extension. If the periodic advertiser changes the
 *        type of the Constant Tone Extension after the Controller has
 *        synchronized with the periodic advertising, it shall remain
 *        synchronized. Note: A value of 0 (i.e. all bits clear) indicates that
 *        the presence or absence of a Constant Tone Extension is irrelevant.
 *        This command does not affect any processing of any periodic
 *        advertising synchronization information already received from the peer
 *        device, whether or not the Controller has yet synchronized to the
 *        periodic advertising train it describes. The parameter values provided
 *        by this command override those provided via the HCI_LE_Set_Default_Per
 *        iodic_Advertising_Sync_Transfer_Parameterscommand or any preferences
 *        previously set using the
 *        HCI_LE_Set_Periodic_Advertising_Sync_Transfer_Parameters command on
 *        the same connection. If the Connection_Handle parameter does not
 *        identify a current connection, the Controller shall return the error
 *        code Unknown Connection Identifier (0x02).
 * @param Connection_Handle Connection handle that identifies the connection.
 *        Values:
 *        - 0x0000 ... 0x0EFF
 * @param Mode The action to be taken when periodic advertising synchronization
 *        information is received. If 0, no attempt is made to synchronize to
 *        the periodic advertising and no
 *        HCI_LE_Periodic_Advertising_Sync_Transfer_Received event is sent to
 *        the Host. If 1, an HCI_LE_Periodic_Advertising_Sync_Transfer_Received
 *        event is sent to the Host. HCI_LE_Periodic_Advertising_Report events
 *        will be disabled. If 2, an
 *        HCI_LE_Periodic_Advertising_Sync_Transfer_Received event is sent to
 *        the Host. HCI_LE_Periodic_Advertising_Report events will be enabled
 *        with duplicate filtering disabled. If 3, an
 *        HCI_LE_Periodic_Advertising_Sync_Transfer_Received event is sent to
 *        the Host. HCI_LE_Periodic_Advertising_Report events will be enabled
 *        with duplicate filtering enabled.
 *        Values:
 *        - 0x00: NO_SYNC
 *        - 0x01: REPORTS_DISABLED
 *        - 0x02: REPORTS_ENABLED
 *        - 0x03: REPORTS_ENABLED_WITH_DUPLICATE_FILTERING
 * @param Skip The number of periodic advertising packets that can be skipped
 *        after a successful receive.
 *        Values:
 *        - 0x0000 ... 0x01F3
 * @param Sync_Timeout Synchronization timeout for the periodic advertising
 *        train. Time = N*10 ms.
 *        Values:
 *        - 0x000A (100 ms)  ... 0x4000 (163840 ms) 
 * @param CTE_Type It specifies whether to only synchronize to periodic
 *        advertising with certain types of Constant Tone Extension.  If bit 0
 *        is set: do not sync to packets with an AoA Constant Tone Extension. If
 *        bit 1 is set: Do not sync to packets with an AoD Constant Tone
 *        Extension with 1 us slots. If bit 2 is set: Do not sync to packets
 *        with an AoD Constant Tone Extension with 2 us slots. If bit 3 is set:
 *        Do not sync to packets without a Constant Tone Extension.
 *        Flags:
 *        - 0x01: DO_NOT_SYNC_WITH_AOA
 *        - 0x02: DO_NOT_SYNC_WITH_AOD_1US
 *        - 0x04: DO_NOT_SYNC_WITH_AOD_2US
 *        - 0x10: DO_NOT_SYNC_WITHOUT_CTE
 * @retval Value indicating success or error code.
 */
tBleStatus hci_le_set_periodic_advertising_sync_transfer_parameters(uint16_t Connection_Handle,
                                                                    uint8_t Mode,
                                                                    uint16_t Skip,
                                                                    uint16_t Sync_Timeout,
                                                                    uint8_t CTE_Type);
/**
 * @brief The HCI_LE_Set_Default_Periodic_Advertising_Sync_Transfer_Parameters
 *        command is used to specify the initial value for the mode, skip,
 *        timeout, and Constant Tone Extension type (set by the
 *        HCI_LE_Set_Periodic_Advertising_Sync_Transfer_Parameters command; see
 *        Section 7.8.91) to be used for all subsequent connections over the LE
 *        transport. The Mode parameter specifies the initial action to be
 *        taken. If Mode is 0x00, the Controller will ignore the information.
 *        Otherwise it will notify the Host and synchronize to the periodic
 *        advertising. Mode also specifies whether periodic advertising reports
 *        are initially enabled or disabled. The Skip parameter specifies the
 *        number of consecutive periodic advertising packets that the receiver
 *        may skip after successfully receiving a periodic advertising packet.
 *        The Sync_Timeout parameter specifies the maximum permitted time
 *        between successful receives. If this time is exceeded, synchronization
 *        is lost. The CTE_Type parameter specifies whether to only synchronize
 *        to periodic advertising with certain types of Constant Tone Extension.
 *        If the periodic advertiser changes the type of the Constant Tone
 *        Extension after the Controller has synchronized with the periodic
 *        advertising, it shall remain synchronized. Note: A value of 0 (i.e.
 *        all bits clear) indicates that the presence or absence of a Constant
 *        Tone Extension is irrelevant. This command does not affect any
 *        existing connection.
 * @param Mode The action to be taken when periodic advertising synchronization
 *        information is received. If 0, no attempt is made to synchronize to
 *        the periodic advertising and no
 *        HCI_LE_Periodic_Advertising_Sync_Transfer_Received event is sent to
 *        the Host. If 1, an HCI_LE_Periodic_Advertising_Sync_Transfer_Received
 *        event is sent to the Host. HCI_LE_Periodic_Advertising_Report events
 *        will be disabled. If 2, an
 *        HCI_LE_Periodic_Advertising_Sync_Transfer_Received event is sent to
 *        the Host. HCI_LE_Periodic_Advertising_Report events will be enabled
 *        with duplicate filtering disabled. If 3, an
 *        HCI_LE_Periodic_Advertising_Sync_Transfer_Received event is sent to
 *        the Host. HCI_LE_Periodic_Advertising_Report events will be enabled
 *        with duplicate filtering enabled.
 *        Values:
 *        - 0x00: NO_SYNC
 *        - 0x01: REPORTS_DISABLED
 *        - 0x02: REPORTS_ENABLED
 *        - 0x03: REPORTS_ENABLED_WITH_DUPLICATE_FILTERING
 * @param Skip The number of periodic advertising packets that can be skipped
 *        after a successful receive.
 *        Values:
 *        - 0x0000 ... 0x01F3
 * @param Sync_Timeout Synchronization timeout for the periodic advertising
 *        train. Time = N*10 ms.
 *        Values:
 *        - 0x000A (100 ms)  ... 0x4000 (163840 ms) 
 * @param CTE_Type It specifies whether to only synchronize to periodic
 *        advertising with certain types of Constant Tone Extension.  If bit 0
 *        is set: do not sync to packets with an AoA Constant Tone Extension. If
 *        bit 1 is set: Do not sync to packets with an AoD Constant Tone
 *        Extension with 1 us slots. If bit 2 is set: Do not sync to packets
 *        with an AoD Constant Tone Extension with 2 us slots. If bit 3 is set:
 *        Do not sync to packets without a Constant Tone Extension.
 *        Flags:
 *        - 0x01: DO_NOT_SYNC_WITH_AOA
 *        - 0x02: DO_NOT_SYNC_WITH_AOD_1US
 *        - 0x04: DO_NOT_SYNC_WITH_AOD_2US
 *        - 0x10: DO_NOT_SYNC_WITHOUT_CTE
 * @retval Value indicating success or error code.
 */
tBleStatus hci_le_set_default_periodic_advertising_sync_transfer_parameters(uint8_t Mode,
                                                                            uint16_t Skip,
                                                                            uint16_t Sync_Timeout,
                                                                            uint8_t CTE_Type);
/**
 * @brief This command is used to read the maximum size of the data portion of
 *        ACL data packets and isochronous data packets sent from the Host to
 *        the Controller. The Host shall segment the data transmitted to the
 *        Controller according to these values so that the HCI Data packets and
 *        isochronous data packets will contain data up to this size. The
 *        HCI_LE_Read_Buffer_Size command also returns the total number of HCI
 *        LE ACL Data packets and isochronous data packets that can be stored in
 *        the data buffers of the Controller. The HCI_LE_Read_Buffer_Size
 *        command shall be issued by the Host before it sends any data to an LE
 *        Controller (see Section 4.1.1). If the Controller supports HCI ISO
 *        Data packets, it shall return non-zero values for the
 *        ISO_Data_Packet_Length and Total_Num_ISO_Data_Packets parameters.
 * @param[out] HC_LE_ACL_Data_Packet_Length 0x0000: No dedicated LE Buffer
 *             exists. Use the HCI_Read_Buffer_Size command. 0x001B - 0xFFFF
 *             Maximum length (in octets) of the data portion of each HCI ACL
 *             data packet.
 *             Values:
 *             - 0x0000: NO_BUFFER
 *             - 0x001B ... 0xFFFF
 * @param[out] HC_Total_Num_LE_ACL_Data_Packets 0x00: No dedicated LE Buffer
 *             exists. Use the HCI_Read_Buffer_Size command. 0x01 - 0xFF: Total
 *             number of HCI ACL Data Packets that can be stored in the data
 *             buffers of the Controller.
 *             Values:
 *             - 0x00: NO_BUFFER
 *             - 0x01 ... 0xFF
 * @param[out] ISO_Data_Packet_Length 0x0000: No dedicated ISO Buffer exists.
 *             0x0001 to 0xFFFF: The maximum length (in octets) of the data
 *             portion of each HCI ISO data packet.
 *             Values:
 *             - 0x0000: NO_BUFFER
 *             - 0x0001 ... 0xFFFF
 * @param[out] Total_Num_ISO_Data_Packets 0x00: No dedicated ISO Buffer exists.
 *             0x01 to 0xFF: The total number of HCI ISO data packets that can
 *             be stored in the ISO buffers of the Controller.
 *             Values:
 *             - 0x00: NO_BUFFER
 *             - 0x01 ... 0xFF
 * @retval Value indicating success or error code.
 */
tBleStatus hci_le_read_buffer_size_v2(uint16_t *HC_LE_ACL_Data_Packet_Length,
                                      uint8_t *HC_Total_Num_LE_ACL_Data_Packets,
                                      uint16_t *ISO_Data_Packet_Length,
                                      uint8_t *Total_Num_ISO_Data_Packets);
/**
 * @brief transmitted SDU identified by the Packet_Sequence_Number on a CIS or
 *        BIS identified by the Connection_Handle parameter on the Central or
 *        Peripheral. The Packet_Sequence_Number parameter contains the sequence
 *        number of a transmitted SDU. The TX_Time_Stamp and Time_Offset
 *        parameters are described in [Vol 6] Part G, Section 3.3 and [Vol 6]
 *        Part G, Section 3.1 respectively. When the Connection_Handle
 *        identifies a CIS or BIS that is transmitting unframed PDUs, the value
 *        of Time_Offset returned shall be zero. If the Host issues this command
 *        with a connection handle that does not exist, or the connection handle
 *        is not associated with a CIS or BIS, the Controller shall return the
 *        error code Unknown Connection Identifier (0x02). If the Host issues
 *        this command on an existing connection handle for a CIS or BIS that is
 *        not configured for transmitting SDUs, the Controller shall return the
 *        error code Command Disallowed (0x0C). If the Host issues this command
 *        before an SDU has been transmitted by the Controller, the Controller
 *        shall return the error code Command Disallowed (0x0C).
 * @param Connection_Handle Connection handle of the CIS or BIS.
 *        Values:
 *        - 0x0000 ... 0x0EFF
 * @param[out] Packet_Sequence_Number The packet sequence number of an SDU.
 * @param[out] TX_Time_Stamp The CIG reference point or BIG anchor point of a
 *             transmitted SDU derived using the Controller's free running
 *             reference clock (in microseconds).
 * @param[out] Time_Offset The time offset, in microseconds, that is associated
 *             with a transmitted SDU.
 * @retval Value indicating success or error code.
 */
tBleStatus hci_le_read_iso_tx_sync(uint16_t Connection_Handle,
                                   uint16_t *Packet_Sequence_Number,
                                   uint32_t *TX_Time_Stamp,
                                   uint8_t Time_Offset[3]);
/**
 * @brief The HCI_LE_Set_CIG_Parameters command is used by a Central's Host to
 *        create a CIG and to set the parameters of one or more CISes that are
 *        associated with a CIG in the Controller. The CIG_ID parameter
 *        identifies a CIG. This parameter is allocated by the Central's Host
 *        and passed to the Peripheral's Host through the Link Layers during the
 *        process of creating a CIS. If the CIG_ID does not exist, then the
 *        Controller shall first create a new CIG. Once the CIG is created
 *        (whether through this command or previously), the Controller shall
 *        modify or add CIS configurations in the CIG that is identified by the
 *        CIG_ID and update all the parameters that apply to the CIG. The
 *        SDU_Interval_C_To_P parameter specifies the time interval between the
 *        start of consecutive SDUs from the Central's Host for all the CISes in
 *        the CIG. This parameter shall be ignored for all CISes that are
 *        unidirectional from Peripheral to Central. The SDU_Interval_P_To_C
 *        parameter specifies the time interval between the start of consecutive
 *        SDUs from the Peripheral's Host for all the CISes in the CIG. This
 *        parameter shall be ignored for all CISes that are unidirectional from
 *        Central to Peripheral. The Worst_Case_SCA parameter shall be the
 *        worst-case sleep clock accuracy of all the Peripherals that will
 *        participate in the CIG. The Host should get the sleep clock accuracy
 *        from all the Peripherals before issuing this command. If the Host
 *        cannot get the sleep clock accuracy from all the Peripherals, it shall
 *        set the Worst_Case_SCA parameter to zero. Note: The Worst_Case_SCA
 *        parameter can be used by the Link Layer to better allow for clock
 *        drift when scheduling the CISes in the CIG. For example, if a CIS has
 *        more than two subevents, the Link Layer of the Central can set the
 *        timing of the subevents such that the worst case drift in the
 *        Peripheral's clock will not exceed 2 x Sub_Interval. This prevents the
 *        Peripheral from synchronizing its timing to the wrong subevent
 *        (adjacent subevents cannot be on the same channel). The Packing
 *        parameter indicates the preferred method of arranging subevents of
 *        multiple CISes. The subevents can be arranged in Sequential or
 *        Interleaved arrangement (see [Vol 6] Part B, Section 4.5.14.2). This
 *        is a recommendation to the Controller which the Controller may ignore.
 *        This parameter shall be ignored when there is only one CIS in the CIG.
 *        The Framing parameter indicates the format of the CIS Data PDUs of the
 *        specified CISes. If the Framing parameter is set to 1 then the CIS
 *        Data PDUs of the specified CISes shall be framed. If the Framing
 *        parameter is set to 0 the CIS Data PDUs of a given CIS may be either
 *        unframed or framed (determined separately for each specified CIS) (see
 *        [Vol 6] Part G, Section 1). The Max_Transport_Latency_C_To_P parameter
 *        contains the maximum transport latency from the Central to the
 *        Peripheral, in milliseconds, as described in [Vol 6] Part G, Section
 *        3.2.1 and [Vol 6] Part G, Section 3.2.2. This parameter shall be
 *        ignored for all CISes that are unidirectional from Peripheral to
 *        Central. The Max_Transport_Latency_P_To_C parameter contains the
 *        maximum transport latency from the Peripheral to the Central, in
 *        milliseconds, as described in [Vol 6] Part G, Section 3.2.1 and [Vol
 *        6] Part G, Section 3.2.2. This parameter shall be ignored for all
 *        CISes that are unidirectional from Central to Peripheral. The
 *        CIS_Count parameter indicates the number of CIS configurations being
 *        modified or added by this command. The Controller shall set the
 *        CIS_Count return parameter equal to this. The CIS_ID[i] parameter
 *        identifies a CIS and is set by the Central's Host and passed to the
 *        Peripheral's Host through the Link Layers during the process of
 *        establishing a CIS. The Max_SDU_C_To_P[i] parameter identifies the
 *        maximum size of an SDU from the Central's Host. If the CIS is
 *        unidirectional from Peripheral to Central, this parameter shall be set
 *        to 0. If a CIS configuration that is being modified has a data path
 *        set in the Central to Peripheral direction and the Host has specified
 *        that Max_SDU_C_To_P[i] shall be set to zero, the Controller shall
 *        return the error code Command Disallowed (0x0C). The Max_SDU_P_To_C[i]
 *        parameter identifies the maximum size of an SDU from the Peripheral's
 *        Host. If the CIS is unidirectional from Central to Peripheral, this
 *        parameter shall be set to 0. If a CIS configuration that is being
 *        modified has a data path set in the Peripheral to Central direction
 *        and the Host has specified that Max_SDU_P_To_C[i] shall be set to
 *        zero, the Controller shall return the error code Command Disallowed
 *        (0x0C). The PHY_C_To_P[i] parameter identifies which PHY to use for
 *        transmission from the Central to the Peripheral. The Host shall set at
 *        least one bit in this parameter and the Controller shall pick a PHY
 *        from the bits that are set. The PHY_P_To_C[i] parameter identifies
 *        which PHY to use for transmission from the Peripheral to the Central.
 *        The Host shall set at least one bit in this parameter and the
 *        Controller shall pick a PHY from the bits that are set. The
 *        RTN_C_To_P[i] (Retransmission Number) parameter contains the number of
 *        times that a CIS Data PDU should be retransmitted from the Central to
 *        Peripheral before being acknowledged or flushed (irrespective of which
 *        isochronous events the retransmission opportunities occur in). If the
 *        CIS is unidirectional from Peripheral to Central, this parameter shall
 *        be ignored. Otherwise, this parameter is a recommendation to the
 *        Controller which the Controller may ignore. The RTN_P_To_C[i]
 *        parameter contains the number of times that a CIS Data PDU should be
 *        retransmitted from the Peripheral to Central before being acknowledged
 *        or flushed (irrespective of which isochronous events the
 *        retransmission opportunities occur in). If the CIS is unidirectional
 *        from Central to Peripheral, this parameter shall be ignored.
 *        Otherwise, this parameter is a recommendation to the Controller which
 *        the Controller may ignore. If the Status return parameter is non-zero,
 *        then the state of the CIG and its CIS configurations shall not be
 *        changed by the command. If the CIG did not already exist, it shall not
 *        be created. If the Status return parameter is zero, then the
 *        Controller shall set the Connection_Handle arrayed return parameter to
 *        the connection handle(s) corresponding to the CIS configurations
 *        specified in the CIS_IDs command parameter, in the same order. If the
 *        same CIS_ID is being reconfigured, the same connection handle shall be
 *        returned. The connection handle of a CIS shall refer to the CIS when
 *        it exists and to the configuration of the CIS stored in a CIG when the
 *        CIG exists but the CIS with that CIS_ID does not. If the Host issues
 *        this command when the CIG is not in the configurable state, the
 *        Controller shall return the error code Command Disallowed (0x0C). If
 *        the Host attempts to create a CIG or set parameters that exceed the
 *        maximum supported resources in the Controller, the Controller shall
 *        return the error code Memory Capacity Exceeded (0x07). If the Host
 *        attempts to set CIS parameters that exceed the maximum supported
 *        connections in the Controller, the Controller shall return the error
 *        code Connection Limit Exceeded (0x09). If the Host sets, in the
 *        PHY_C_To_P[i] or PHY_P_To_C[i] parameters, a bit for a PHY that the
 *        Controller does not support, including a bit that is reserved for
