sheulisback/ble-demo-wb05kn1-nucleo-u545/firmware/Middlewares/ST/STM32WB05N/includes/stm32wb05n_hci_le.h
 *        future use, the Controller shall return the error code Unsupported
 *        Feature or Parameter Value (0x11). If the Controller does not support
 *        asymmetric PHYs and the Host sets PHY_C_To_P[i] to a different value
 *        than PHY_P_To_C[i], the Controller shall return the error code
 *        Unsupported Feature or Parameter Value (0x11). If the Host specifies
 *        an invalid combination of CIS parameters, the Controller shall return
 *        the error code Unsupported Feature or Parameter Value (0x11).
 * @param CIG_ID Used to identify the CIG.
 *        Values:
 *        - 0x00 ... 0xEF
 * @param SDU_Interval_C_To_P The interval, in microseconds, of periodic SDUs.
 *        Values:
 *        - 0x0000FF ... 0x0FFFFF
 * @param SDU_Interval_P_To_C The interval, in microseconds, of periodic SDUs.
 *        Values:
 *        - 0x0000FF ... 0x0FFFFF
 * @param Worst_Case_SCA Worst-case sleep clock accuracy of all the Peripherals.
 *        Values:
 *        - 0x00: 251 ppm to 500 ppm
 *        - 0x01: 151 ppm to 250 ppm
 *        - 0x02: 101 ppm to 150 ppm
 *        - 0x03: 76 ppm to 100 ppm
 *        - 0x04: 51 ppm to 75 ppm
 *        - 0x05: 31 ppm to 50 ppm
 *        - 0x06: 21 ppm to 30 ppm
 *        - 0x07: 0 ppm to 20 ppm
 * @param Packing Preferred method of arranging subevents of multiple CISes.
 *        Values:
 *        - 0x00: Sequential
 *        - 0x01: Interleaved
 * @param Framing Format of the CIS Data PDUs of the specified CISes.
 *        Values:
 *        - 0x00: Unframed
 *        - 0x01: Framed
 * @param Max_Transport_Latency_C_To_P Maximum transport latency, in
 *        milliseconds, from the Central's Controller to the Peripheral's
 *        Controller.
 *        Values:
 *        - 0x0005 ... 0x0FA0
 * @param Max_Transport_Latency_P_To_C Maximum transport latency, in
 *        milliseconds, from the Peripheral's Controller to the Central's
 *        Controller.
 *        Values:
 *        - 0x0005 ... 0x0FA0
 * @param CIS_Count Total number of CIS configurations in the CIG being added or
 *        modified.
 *        Values:
 *        - 0x00 ... 0x1F
 * @param CIS_Param See @ref CIS_Param_t
 * @param[out] Connection_Handle Connection handle of the CIS in the CIG.
 * @retval Value indicating success or error code.
 */
tBleStatus hci_le_set_cig_parameters(uint8_t CIG_ID,
                                     uint8_t SDU_Interval_C_To_P[3],
                                     uint8_t SDU_Interval_P_To_C[3],
                                     uint8_t Worst_Case_SCA,
                                     uint8_t Packing,
                                     uint8_t Framing,
                                     uint16_t Max_Transport_Latency_C_To_P,
                                     uint16_t Max_Transport_Latency_P_To_C,
                                     uint8_t CIS_Count,
                                     CIS_Param_t CIS_Param[],
                                     uint16_t Connection_Handle[]);
/**
 * @brief The HCI_LE_Set_CIG_Parameters_Test command should only be used for
 *        testing purposes. The command is used by a Central's Host to create a
 *        CIG and to set the parameters of one or more CISes that are associated
 *        with a CIG in the Controller. The CIG_ID parameter identifies a CIG.
 *        This parameter is allocated by the Central's Host and passed to the
 *        Peripheral's Host through the Link Layers during the process of
 *        creating a CIS. If the CIG_ID does not exist, then the Controller
 *        shall first create a new CIG. Once the CIG is created (whether through
 *        this command or previously), the Controller shall modify or add CIS
 *        configurations in the CIG that is identified by the CIG_ID and update
 *        all the parameters that apply to the CIG. The SDU_Interval_C_To_P
 *        parameter specifies the time interval of periodic SDUs from the
 *        Central's Host. The SDU_Interval_P_To_C parameter specifies the time
 *        interval of periodic SDUs from the Peripheral's Host. The FT_C_To_P
 *        parameter identifies the maximum time for a payload from the Central
 *        to Peripheral to be transmitted and re-transmitted, after which it is
 *        flushed (see [Vol 6] Part B, Section 4.5.13.5). This parameter is
 *        expressed in multiples of ISO_Interval. The FT_P_To_C parameter
 *        identifies the maximum time for a payload from the Peripheral to
 *        Central to be transmitted and re-transmitted, after which it is
 *        flushed (see[Vol 6] Part B, Section 4.5.13.5). This parameter is
 *        expressed in multiples of ISO_Interval. The ISO_Interval parameter
 *        specifies the time between two consecutive CIS anchor points. The
 *        CIS_Count parameter contains the number of CIS configurations being
 *        added or modified by this command. The Controller shall set the
 *        CIS_Count return parameter equal to this. The CIS_ID[i] parameter
 *        identifies the CIS and is set by the Central's Host and passed to the
 *        Peripheral's Host through the Link Layers during the process of
 *        establishing a CIS. The Worst_Case_SCA parameter is the worst-case
 *        sleep clock accuracy of all the Peripherals that will participate in
 *        the CIG. The Host should get the sleep clock accuracy from all the
 *        Peripherals before issuing this command. In case the Host cannot get
 *        the sleep clock accuracy from all the Peripherals, it shall set the
 *        Worst_Case_SCA parameter to zero. Note: The Worst_Case_SCA parameter
 *        can be used by the Link Layer to better allow for clock drift when
 *        scheduling the CISes in the CIG. For example, if a CIS has more than
 *        two subevents, the Link Layer of the Central can set the timing of the
 *        subevents such that the worst case drift in the Peripheral's clock
 *        will not exceed 2 x Sub_Interval. This prevents the Peripheral from
 *        synchronizing its timing to the wrong subevent (adjacent subevents
 *        cannot be on the same channel). The Packing parameter is used to
 *        indicate the preferred method of arranging subevents of multiple
 *        CISes. The subevents can be arranged in Sequential or Interleaved
 *        arrangement. This is a recommendation to the Controller which it may
 *        ignore. This parameter shall be ignored when there is only one CIS in
 *        the CIG. The Framing parameter indicates the format of the CIS Data
 *        PDUs of all the CISes. If the Framing parameter is set to 1 then the
 *        CIS Data PDUs of the specified CISes shall be framed, and when set to
 *        0 they shall be unframed (see [Vol 6] Part G, Section 1). The
 *        CIS_ID[i] parameter is used to identify a CIS. The NSE[i] parameter
 *        identifies the maximum number of subevents for each CIS in a CIG
 *        event. The Max_SDU_C_To_P[i] parameter identifies the maximum size of
 *        SDU from the Central's Host. If the CIS is unidirectional from
 *        Peripheral to Central, this parameter shall be set to 0. If a CIS
 *        configuration that is being modified has a data path set in the
 *        Central to Peripheral direction and the Host has specified that
 *        Max_SDU_C_To_P[i] shall be set to zero, the Controller shall return
 *        the error code Command Disallowed (0x0C). The minimum value of the
 *        Max_SDU_Size parameter in the ISO Transmit Test mode when the
 *        Payload_Type = 1 or 2 shall be 4 octets. The Max_SDU_P_To_C[i]
 *        parameter identifies the maximum size of SDU from the Peripheral's
 *        Host. If the CIS is unidirectional from Central to Peripheral, this
 *        parameter shall be set to 0. If a CIS configuration that is being
 *        modified has a data path set in the Peripheral to Central direction
 *        and the Host has specified that Max_SDU_P_To_C[i] shall be set to
 *        zero, the Controller shall return the error code Command Disallowed
 *        (0x0C).The minimum value of the Max_SDU parameter in the ISO Transmit
 *        Test mode when the Payload_Type = 1 or 2 shall be 4 octets. The
 *        Max_PDU_C_To_P[i] parameter identifies the maximum size PDU from the
 *        Central to Peripheral. The Max_PDU_P_To_C[i] parameter identifies the
 *        maximum size PDU from the Peripheral to Central. The PHY_C_To_P[i]
 *        parameter identifies the PHY to be used for transmission of packets
 *        from the Central to the Peripheral. The Host shall set only one bit in
 *        this parameter and the Controller shall use the PHY set by the Host.
 *        The PHY_P_To_C[i] parameter identifies the PHY to be used for
 *        transmission of packets from the Peripheral to the Central. The Host
 *        shall set only one bit in this parameter and the Controller shall use
 *        the PHY set by the Host. The BN_C_To_P[i] parameter identifies the
 *        burst number for Central to Peripheral (see [Vol 6] Part B, Section
 *        4.5.13). If the CIS is unidirectional from Peripheral to Central, this
 *        parameter shall be set to zero. The BN_P_To_C[i] parameter identifies
 *        the burst number for Peripheral to Central (see [Vol 6] Part B,
 *        Section 4.5.13). If the CIS is unidirectional from Central to
 *        Peripheral, this parameter shall be set to zero. If the Status return
 *        parameter is non-zero, then the state of the CIG and its CIS
 *        configurations shall not be changed by the command. If the CIG did not
 *        already exist, it shall not be created. If the Status return parameter
 *        is zero, then the Controller shall set the Connection_Handle arrayed
 *        return parameter to the connection handle(s) corresponding to the CIS
 *        configurations specified in the CIS_IDs command parameter, in the same
 *        order. If the same CIS_ID is being reconfigured, the same connection
 *        handle shall be returned. If the Host issues this command when the CIG
 *        is not in the configurable state, the Controller shall return the
 *        error code Command Disallowed (0x0C). If the Host attempts to create a
 *        CIG or set parameters that exceed the maximum supported resources in
 *        the Controller, the Controller shall return the error code Memory
 *        Capacity Exceeded (0x07). If the Host attempts to set CIS parameters
 *        that exceed the maximum supported connections in the Controller, the
 *        Controller shall return the error code Connection Limit Exceeded
 *        (0x09). If the Host attempts to set an invalid combination of CIS
 *        parameters, the Controller shall return the error code Unsupported
 *        Feature or Parameter Value (0x11). If the Host sets, in the
 *        PHY_C_To_P[i] or PHY_P_To_C[i] parameters, a bit for a PHY that the
 *        Controller does not support, including a bit that is reserved for
 *        future use, the Controller shall return the error code Unsupported
 *        Feature or Parameter Value (0x11). If the Controller does not support
 *        asymmetric PHYs and the Host sets PHY_C_To_P[i] to a different value
 *        than PHY_P_To_C[i], the Controller shall return the error code
 *        Unsupported Feature or Parameter Value (0x11).
 * @param CIG_ID Used to identify the CIG.
 *        Values:
 *        - 0x00 ... 0xEF
 * @param SDU_Interval_C_To_P The interval, in microseconds, of periodic SDUs.
 *        Values:
 *        - 0x0000FF ... 0x0FFFFF
 * @param SDU_Interval_P_To_C The interval, in microseconds, of periodic SDUs.
 *        Values:
 *        - 0x0000FF ... 0x0FFFFF
 * @param FT_C_To_P The flush timeout in multiples of ISO_Interval for each
 *        payload sent from the Central to Peripheral.
 *        Values:
 *        - 0x01 ... 0xFF
 * @param FT_P_To_C The flush timeout in multiples of ISO_Interval for each
 *        payload sent from the Peripheral to Central.
 *        Values:
 *        - 0x01 ... 0xFF
 * @param ISO_Interval Time between consecutive CIS anchor points. Time = N *
 *        1.25 ms
 *        Values:
 *        - 0x0004 (5.00 ms)  ... 0x0C80 (4000.00 ms) 
 * @param Worst_Case_SCA Worst-case sleep clock accuracy of all the Peripherals.
 *        Values:
 *        - 0x00: 251 ppm to 500 ppm
 *        - 0x01: 151 ppm to 250 ppm
 *        - 0x02: 101 ppm to 150 ppm
 *        - 0x03: 76 ppm to 100 ppm
 *        - 0x04: 51 ppm to 75 ppm
 *        - 0x05: 31 ppm to 50 ppm
 *        - 0x06: 21 ppm to 30 ppm
 *        - 0x07: 0 ppm to 20 ppm
 * @param Packing Preferred method of arranging subevents of multiple CISes.
 *        Values:
 *        - 0x00: Sequential
 *        - 0x01: Interleaved
 * @param Framing Format of the CIS Data PDUs of the specified CISes.
 *        Values:
 *        - 0x00: Unframed
 *        - 0x01: Framed
 * @param CIS_Count Total number of CIS configurations in the CIG being added or
 *        modified.
 *        Values:
 *        - 0x00 ... 0x1F
 * @param CIS_Param_Test See @ref CIS_Param_Test_t
 * @param[out] Connection_Handle Connection handle of the CIS in the CIG.
 * @retval Value indicating success or error code.
 */
tBleStatus hci_le_set_cig_parameters_test(uint8_t CIG_ID,
                                          uint8_t SDU_Interval_C_To_P[3],
                                          uint8_t SDU_Interval_P_To_C[3],
                                          uint8_t FT_C_To_P,
                                          uint8_t FT_P_To_C,
                                          uint16_t ISO_Interval,
                                          uint8_t Worst_Case_SCA,
                                          uint8_t Packing,
                                          uint8_t Framing,
                                          uint8_t CIS_Count,
                                          CIS_Param_Test_t CIS_Param_Test[],
                                          uint16_t Connection_Handle[]);
/**
 * @brief The HCI_LE_Create_CIS command is used by the Central's Host to create
 *        one or more CISes using the connections identified by the
 *        ACL_Connection_Handle arrayed parameter. The CIS_Count parameter is
 *        the total number of CISes created by this command. The
 *        CIS_Connection_Handle[i] parameter specifies the connection handle
 *        corresponding to the configuration of the CIS to be created and whose
 *        configuration is already stored in a CIG. The ACL_Connection_Handle[i]
 *        parameter specifies the connection handle of the ACL connection
 *        associated with each CIS to be created. The list of the
 *        ACL_Connection_Handles shall be in the same order as the list of the
 *        CIS_Connection_Handles e.g., CIS_Connection_Handle[1] will connect to
 *        the Peripheral associated with the ACL_Connection_Handle[1]. If any
 *        ACL_Connection_Handle[i] is not the handle of an existing ACL
 *        connection or any CIS_Connection_Handle[i] is not the handle of a CIS
 *        or CIS configuration, the Controller shall return the error code
 *        Unknown Connection Identifier (0x02). If the Host attempts to create a
 *        CIS that has already been created, the Controller shall return the
 *        error code Connection Already Exists (0x0B). If two different elements
 *        of the CIS_Connection_Handle arrayed parameter identify the same CIS,
 *        the Controller shall return the error code Invalid HCI Command
 *        Parameters (0x12). If the Host issues this command before all the
 *        HCI_LE_CIS_Established events from the previous use of the command
 *        have been generated, the Controller shall return the error code
 *        Command Disallowed (0x0C). If the Host issues this command on an
 *        ACL_Connection_Handle where the Controller is the Peripheral, the
 *        Controller shall return the error code Command Disallowed (0x0C).
 *        Note: The order of the CIS connection handles in this command does not
 *        relate to the order of connection handles in the return parameters of
 *        the HCI_LE_Set_CIG_Parameters command or the
 *        HCI_LE_Set_CIG_Parameters_Test command. If the Host issues this
 *        command when the Connected Isochronous Stream (Host Support) feature
 *        bit (see [Vol 6] Part B, Section 4.6.27) is not set, the Controller
 *        shall return the error code Command Disallowed (0x0C).
 * @param CIS_Count Total number of CISes to be created.
 *        Values:
 *        - 0x01 ... 0x1F
 * @param CIS_Handles See @ref CIS_Handles_t
 * @retval Value indicating success or error code.
 */
tBleStatus hci_le_create_cis(uint8_t CIS_Count,
                             CIS_Handles_t CIS_Handles[]);
/**
 * @brief The HCI_LE_Remove_CIG command is used by the Central's Host to remove
 *        the CIG identified by CIG_ID. The CIG_ID parameter contains the
 *        identifier of the CIG. This command shall delete the CIG_ID and also
 *        delete the Connection_Handles of the CIS configurations stored in the
 *        CIG. This command shall also remove the isochronous data paths that
 *        are associated with the Connection_Handles of the CIS configurations,
 *        which is equivalent to issuing the HCI_LE_Remove_ISO_Data_Path command
 *        (see Section 7.8.109). If the Host tries to remove a CIG which is in
 *        the active state, then the Controller shall return the error code
 *        Command Disallowed (0x0C). If the Host issues this command with a
 *        CIG_ID that does not exist, the Controller shall return the error code
 *        Unknown Connection Identifier (0x02).
 * @param CIG_ID Identifier of a CIG.
 *        Values:
 *        - 0x00 ... 0xEF
 * @retval Value indicating success or error code.
 */
tBleStatus hci_le_remove_cig(uint8_t CIG_ID);
/**
 * @brief The HCI_LE_Accept_CIS_Request command is used by the Peripheral's Host
 *        to inform the Controller to accept the request for the CIS that is
 *        identified by the Connection_Handle. The command shall only be issued
 *        after an HCI_LE_CIS_Request event has occurred. The event contains the
 *        Connection_Handle of the CIS. If the Peripheral's Host issues this
 *        command with a Connection_Handle that does not exist, or the
 *        Connection_Handle is not for a CIS, the Controller shall return the
 *        error code Unknown Connection Identifier (0x02). If the Peripheral's
 *        Host issues this command with a Connection_Handle for a CIS that has
 *        already been established or that already has an
 *        HCI_LE_Accept_CIS_Request or HCI_LE_Reject_CIS_Request command in
 *        progress, the Controller shall return the error code Command
 *        Disallowed (0x0C). If the Central's Host issues this command, the
 *        Controller shall return the error code Command Disallowed (0x0C).
 * @param Connection_Handle Connection handle of the CIS.
 *        Values:
 *        - 0x0000 ... 0x0EFF
 * @retval Value indicating success or error code.
 */
tBleStatus hci_le_accept_cis_request(uint16_t Connection_Handle);
/**
 * @brief The HCI_LE_Reject_CIS_Request command is used by the Peripheral's Host
 *        to inform the Controller to reject the request for the CIS that is
 *        identified by the Connection_Handle. The command shall only be issued
 *        after an HCI_LE_CIS_Request event has occurred. The event contains the
 *        Connection_Handle of the CIS. When this command succeeds, the
 *        Controller shall delete the Connection_Handle of the requested CIS.
 *        The Reason command parameter indicates the reason for rejecting the
 *        CIS request. If the Peripheral's Host issues this command with a
 *        Connection_Handle that is not for a CIS, the Controller shall return
 *        the error code Unknown Connection Identifier (0x02). If the
 *        Peripheral's Host issues this command with a Connection_Handle for a
 *        CIS that has already been established or that already has an HCI_LE_-
 *        Accept_CIS_Request or HCI_LE_Reject_CIS_Request command in progress,
 *        the Controller shall return the error code Command Disallowed (0x0C).
 *        If the Central's Host issues this command, the Controller shall return
 *        the error code Command Disallowed (0x0C).
 * @param Connection_Handle Reason the CIS request was rejected. See [Vol 1]
 *        Part F, Controller Error Codes for a list of error codes and
 *        descriptions.
 * @param Reason Reason the CIS request was rejected. See [Vol 1] Part F,
 *        Controller Error Codes for a list of error codes and descriptions.
 * @retval Value indicating success or error code.
 */
tBleStatus hci_le_reject_cis_request(uint16_t Connection_Handle,
                                     uint8_t Reason);
/**
 * @brief The HCI_LE_Create_BIG command is used to create a BIG with one or more
 *        BISes (see [Vol 6] Part B, Section 4.4.6). All BISes in a BIG have the
 *        same value for all parameters. The BIG_Handle contains the identifier
 *        of the BIG. This parameter is allocated by the Host and used by the
 *        Controller and the Host to identify a BIG. The Advertising_Handle
 *        identifies the associated periodic advertising train of the BIG (see
 *        [Vol 6] Part B, Section 4.4.5.1). The Num_BIS parameter contains the
 *        total number of BISes in the BIG. The SDU_Interval parameter contains
 *        the time interval of the periodic SDUs. The Max_SDU parameter contains
 *        the maximum size of an SDU. The Max_Transport_Latency parameter is the
 *        maximum transport latency (in milliseconds) as described in [Vol 6]
 *        Part G, Section 3.2.1 and [Vol 6] Part G, Section 3.2.2. This includes
 *        pre-transmissions. The RTN (Retransmission Number) parameter contains
 *        the number of times every PDU should be retransmitted, irrespective of
 *        which isochronous events the retransmissions occur in. This is a
 *        recommendation to the Controller which the Controller may ignore. The
 *        PHY parameter is a bit field that indicates the PHY used for
 *        transmission of PDUs of BISes in the BIG. The Host shall set at least
 *        one bit in this parameter and the Controller shall pick a PHY from the
 *        bits set. If the Host sets, in the PHY parameter, a bit for a PHY that
 *        the Controller does not support, including a bit that is reserved for
 *        future use, the Controller shall return the error code Unsupported
 *        Feature or Parameter Value (0x11). The Packing parameter is used to
 *        indicate the preferred method of arranging subevents of multiple
 *        BISes. The subevents can be arranged in Sequential or Interleaved
 *        arrangement. This is a recommendation to the Controller which it may
 *        ignore. This parameter shall be ignored when there is only one BIS in
 *        the BIG. The Framing parameter indicates the format for sending BIS
 *        Data PDUs. If the Framing parameter is set to 1 then BIS Data PDUs
 *        shall be Framed and when set to 0 they may be unframed (see [Vol 6]
 *        Part G, Section 1). The Encryption parameter identifies the encryption
 *        mode of the BISes. If the Encryption parameter is set to 1
 *        (encrypted), the Broadcast_Code is used in the encryption of payloads
 *        (see [Vol 6] Part B, Section 4.4.6.10). The Broadcast_Code parameter
 *        is used to generate the encryption key for encrypting payloads of all
 *        BISes. When the Encryption parameter is set to 0 (unencrypted), the
 *        Broadcast_Code parameter shall be set to zero by the Host and ignored
 *        by the Controller. If the Controller cannot create all BISes of the
