sheulisback/ble-demo-wb05kn1-nucleo-u545/firmware/Middlewares/ST/STM32WB05N/includes/stm32wb05n_hci_le.h
 *        BIG or if Num_BIS exceeds the maximum value supported by the
 *        Controller, it shall return the error code Connection Rejected due to
 *        Limited Resources (0x0D). If the Advertising_Handle does not identify
 *        a periodic advertising train or the periodic advertising train is
 *        associated with another BIG, the Controller shall return the error
 *        code Unknown Advertising Identifier (0x42). If the Host issues this
 *        command with a BIG_Handle for a BIG that is already created, the
 *        Controller shall return the error code Command Disallowed (0x0C). If
 *        the Host specifies an invalid combination of BIG parameters, the
 *        Controller shall return an error which should use the error code
 *        Unsupported Feature or Parameter Value (0x11).
 * @param BIG_Handle Used to identify the BIG.
 *        Values:
 *        - 0x00 ... 0xEF
 * @param Advertising_Handle Used to identify the periodic advertising train.
 *        Values:
 *        - 0x00 ... 0xEF
 * @param Num_BIS Total number of BISes in the BIG.
 *        Values:
 *        - 0x01 ... 0x1F
 * @param SDU_Interval The interval, in microseconds, of periodic SDUs.
 *        Values:
 *        - 0x0000FF ... 0x0FFFFF
 * @param Max_SDU Maximum size of an SDU, in octets.
 *        Values:
 *        - 0x0001 ... 0x0FFF
 * @param Max_Transport_Latency Maximum transport latency, in milliseconds.
 *        Values:
 *        - 0x0005 ... 0x0FA0
 * @param RTN The number of times that every BIS Data PDU should be
 *        retransmitted.
 *        Values:
 *        - 0x00 ... 0x1E
 * @param PHY Transmitter PHY of packets.
 *        Flags:
 *        - 0x01: LE_1M_PHY_BIT
 *        - 0x02: LE_2M_PHY_BIT
 *        - 0x04: LE_CODED_PHY_BIT
 * @param Packing Used to indicate the preferred method of arranging subevents
 *        of multiple BISes.
 *        Values:
 *        - 0x00: Sequential
 *        - 0x01: Interleaved
 * @param Framing The format for sending BIS Data PDUs.
 *        Values:
 *        - 0x00: Unframed
 *        - 0x01: Framed
 * @param Encryption The encryption mode of the BISes.
 *        Values:
 *        - 0x00: Unencrypted
 *        - 0x01: Encrypted
 * @param Broadcast_Code 128-bit code used for deriving the session key for
 *        decrypting payloads of BISes in the BIG.
 * @retval Value indicating success or error code.
 */
tBleStatus hci_le_create_big(uint8_t BIG_Handle,
                             uint8_t Advertising_Handle,
                             uint8_t Num_BIS,
                             uint8_t SDU_Interval[3],
                             uint16_t Max_SDU,
                             uint16_t Max_Transport_Latency,
                             uint8_t RTN,
                             uint8_t PHY,
                             uint8_t Packing,
                             uint8_t Framing,
                             uint8_t Encryption,
                             uint8_t Broadcast_Code[16]);
/**
 * @brief The HCI_LE_Create_BIG_Test command should only be used for testing
 *        purposes. The command is used to create one or more BISes of a BIG.
 *        All BISes in the BIG have the same values for all parameters.
 * @param BIG_Handle Used to identify the BIG.
 *        Values:
 *        - 0x00 ... 0xEF
 * @param Advertising_Handle Used to identify the periodic advertising train.
 *        Values:
 *        - 0x00 ... 0xEF
 * @param Num_BIS Total number of BISes in the BIG.
 *        Values:
 *        - 0x01 ... 0x1F
 * @param SDU_Interval The interval, in microseconds, of periodic SDUs.
 *        Values:
 *        - 0x0000FF ... 0x0FFFFF
 * @param ISO_Interval The time between consecutive BIG anchor points. Time = N
 *        * 1.25 ms Time Range: 5 ms to 4 s
 *        Values:
 *        - 0x0004 (5.00 ms)  ... 0x0C80 (4000.00 ms) 
 * @param NSE The total number of subevents in each interval of each BIS in the
 *        BIG.
 *        Values:
 *        - 0x01 ... 0x1F
 * @param Max_SDU Maximum size of an SDU, in octets.
 *        Values:
 *        - 0x0001 ... 0x0FFF
 * @param Max_PDU Maximum size, in octets, of payload
 *        Values:
 *        - 0x0001 ... 0x00FB
 * @param PHY Transmitter PHY of packets.
 *        Flags:
 *        - 0x01: LE_1M_PHY_BIT
 *        - 0x02: LE_2M_PHY_BIT
 *        - 0x04: LE_CODED_PHY_BIT
 * @param Packing Used to indicate the preferred method of arranging subevents
 *        of multiple BISes.
 *        Values:
 *        - 0x00: Sequential
 *        - 0x01: Interleaved
 * @param Framing The format for sending BIS Data PDUs.
 *        Values:
 *        - 0x00: Unframed
 *        - 0x01: Framed
 * @param BN The number of new payloads in each interval for each BIS.
 *        Values:
 *        - 0x01 ... 0x07
 * @param IRC The number of times the scheduled payload(s) are transmitted in a
 *        given event.
 *        Values:
 *        - 0x01 ... 0x0F
 * @param PTO Offset used for pre-transmissions.
 *        Values:
 *        - 0x00 ... 0x0F
 * @param Encryption The encryption mode of the BISes.
 *        Values:
 *        - 0x00: Unencrypted
 *        - 0x01: Encrypted
 * @param Broadcast_Code 128-bit code used for deriving the session key for
 *        decrypting payloads of BISes in the BIG.
 * @retval Value indicating success or error code.
 */
tBleStatus hci_le_create_big_test(uint8_t BIG_Handle,
                                  uint8_t Advertising_Handle,
                                  uint8_t Num_BIS,
                                  uint8_t SDU_Interval[3],
                                  uint16_t ISO_Interval,
                                  uint8_t NSE,
                                  uint16_t Max_SDU,
                                  uint16_t Max_PDU,
                                  uint8_t PHY,
                                  uint8_t Packing,
                                  uint8_t Framing,
                                  uint8_t BN,
                                  uint8_t IRC,
                                  uint8_t PTO,
                                  uint8_t Encryption,
                                  uint8_t Broadcast_Code[16]);
/**
 * @brief The HCI_LE_Terminate_BIG command is used to terminate a BIG identified
 *        by the BIG_Handle parameter. The command also terminates the
 *        transmission of all BISes of the BIG, destroys the associated
 *        connection handles of the BISes in the BIG and removes the data paths
 *        for all BISes in the BIG.
 * @param BIG_Handle Used to identify the BIG.
 *        Values:
 *        - 0x00 ... 0xEF
 * @param Reason Reason for disconnection. See Error Codes.
 * @retval Value indicating success or error code.
 */
tBleStatus hci_le_terminate_big(uint8_t BIG_Handle,
                                uint8_t Reason);
/**
 * @brief The HCI_LE_BIG_Create_Sync command is used to synchronize to a BIG
 *        described in the periodic advertising train specified by the
 *        Sync_Handle parameter.
 * @param BIG_Handle Used to identify the BIG.
 *        Values:
 *        - 0x00 ... 0xEF
 * @param Sync_Handle Identifier of the periodic advertising train.
 *        Values:
 *        - 0x0000 ... 0x00EF
 * @param Encryption The encryption mode of the BIG.
 *        Values:
 *        - 0x00: Unencrypted
 *        - 0x01: Encrypted
 * @param Broadcast_Code 128-bit code used for deriving the session key for
 *        decrypting payloads of BISes in the BIG.
 * @param MSE The MSE (Maximum Subevents) parameter is the maximum number of
 *        subevents that a Controller should use to receive data payloads in
 *        each interval for a BIS. The Host should set MSE to reduce the maximum
 *        continuous radio receiving time for a Synchronized Receiver with
 *        limited battery capacity.
 *        Values:
 *        - 0x00: Any number of subevents
 *        - 0x01 ... 0x1F
 * @param BIG_Sync_Timeout The BIG_Sync_Timeout parameter specifies the maximum
 *        permitted time between successful receptions of BIS PDUs. If this time
 *        is exceeded, synchronization is lost. When the Controller establishes
 *        synchronization and if the BIG_Sync_Timeout set by the Host is less
 *        than 6 * ISO_Interval, the Controller shall set the timeout to 6 *
 *        ISO_Interval.
 *        Values:
 *        - 0x000A (100 ms)  ... 0x4000 (163840 ms) 
 * @param Num_BIS Total number of BISes to synchronize.
 *        Values:
 *        - 0x01 ... 0x1F
 * @param BIS List of indices of BISes.
 * @retval Value indicating success or error code.
 */
tBleStatus hci_le_big_create_sync(uint8_t BIG_Handle,
                                  uint16_t Sync_Handle,
                                  uint8_t Encryption,
                                  uint8_t Broadcast_Code[16],
                                  uint8_t MSE,
                                  uint16_t BIG_Sync_Timeout,
                                  uint8_t Num_BIS,
                                  uint8_t BIS[]);
/**
 * @brief The HCI_LE_BIG_Terminate_Sync command is used to stop synchronizing or
 *        cancel the process of synchronizing to the BIG identified by the
 *        BIG_Handle parameter. The command also terminates the reception of
 *        BISes in the BIG specified in the HCI_LE_BIG_Create_Sync command,
 *        destroys the associated connection handles of the BISes in the BIG and
 *        removes the data paths for all BISes in the BIG.
 * @param BIG_Handle Used to identify the BIG.
 *        Values:
 *        - 0x00 ... 0xEF
 * @retval Value indicating success or error code.
 */
tBleStatus hci_le_big_terminate_sync(uint8_t BIG_Handle);
/**
 * @brief This command is used to read the Sleep Clock Accuracy (SCA) of the
 *        peer device. The Connection_Handle parameter is the connection handle
 *        of the ACL connection. If the Host sends this command with a
 *        Connection_Handle that does not exist, or the Connection_Handle is not
 *        for an ACL the Controller shall return the error code Unknown
 *        Connection Identifier (0x02). If the Host sends this command and the
 *        peer device does not support the Sleep Clock Accuracy Updates feature,
 *        the Controller shall return the error code Unsupported Feature or
 *        Parameter Value (0x11) in the  HCI_LE_Request_Peer_SCA_Complete event.
 *        If the Host issues this command when the Controller is aware (e.g.,
 *        through a previous feature exchange) that the peer device's Link Layer
 *        does not support the Sleep Clock Accuracy Updates feature, the
 *        Controller shall return the error code Unsupported Remote Feature
 *        (0x1A). When the HCI_LE_Request_Peer_SCA command has completed, the
 *        HCI_LE_Request_Peer_SCA_Complete event shall be generated.
 * @param Connection_Handle Connection handle of the ACL.
 *        Values:
 *        - 0x0000 ... 0x0EFF
 * @retval Value indicating success or error code.
 */
tBleStatus hci_le_request_peer_sca(uint16_t Connection_Handle);
/**
 * @brief The HCI_LE_Setup_ISO_Data_Path command is used to identify and create
 *        the isochronous data path between the Host and the Controller for an
 *        established CIS or BIS identified by the Connection_Handle parameter.
 *        This command can also be used to configure a codec for each data path.
 * @param Connection_Handle Connection handle of the CIS or BIS.
 *        Values:
 *        - 0x0000 ... 0x0EFF
 * @param Data_Path_Direction The Data_Path_Direction parameter specifies the
 *        direction for which the data path is being configured. The input and
 *        output directions are defined from the perspective of the Controller,
 *        so "input" refers to data flowing from the Host to the Controller.
 *        Values:
 *        - 0x00: Input
 *        - 0x01: Output
 * @param Data_Path_ID The Data_Path_ID parameter specifies the data transport
 *        path used. When set to 0x00, the data path shall be over the HCI
 *        transport. When set to 0xFF the path shall be disabled. When set to a
 *        value in the range 0x01 to 0xFE, the data path shall use a vendor-
 *        specific transport interface (e.g., a PCM interface) with logical
 *        transport numbers. The meanings of these logical transport numbers are
 *        vendor-specific.
 *        Values:
 *        - 0x00: HCI
 *        - 0x01 ... 0xFE
 *        - 0xFF: Disabled
 * @param Codec_ID The Codec_ID parameter specifies the coding format used over
 *        the air. Octet 0: See Assigned Numbers for Coding Format. Octets 1 to
 *        2: Company ID, see Assigned Numbers for Company Identifier. Shall be
 *        ignored if octet 0 is not 0xFF. Octets 3 to 4: Vendor-defined codec
 *        ID. Shall be ignored if octet 0 is not 0xFF.
 * @param Controller_Delay Controller delay in microseconds. When
 *        Data_Path_Direction is set to 0x00 (input), the Controller_Delay
 *        parameter specifies the delay at the data source from the reference
 *        time of an SDU to the CIG reference point (see Bluetooth Core v5.2
 *        [Vol 6] Part B, Section 4.5.14.1) or BIG anchor point (see Core v5.2
 *        [Vol 6] Part B, Section 4.4.6.4). When Data_Path_Direction is set to
 *        0x01 (output), Controller_Delay specifies the delay from the CIG
 *        synchronization point or BIG synchronization point to the point in
 *        time at which the Controller begins to transfer the corresponding data
 *        to the data path interface.
 *        Values:
 *        - 0x000000 ... 0x3D0900
 * @param Codec_Configuration_Length Length of codec configuration.
 * @param Codec_Configuration The Codec_Configuration parameter specifies codec-
 *        specific configuration information for the specified direction.
 * @retval Value indicating success or error code.
 */
tBleStatus hci_le_setup_iso_data_path(uint16_t Connection_Handle,
                                      uint8_t Data_Path_Direction,
                                      uint8_t Data_Path_ID,
                                      uint8_t Codec_ID[5],
                                      uint8_t Controller_Delay[3],
                                      uint8_t Codec_Configuration_Length,
                                      uint8_t Codec_Configuration[]);
/**
 * @brief The HCI_LE_Remove_ISO_Data_Path command is used to remove the input
 *        and/or output data path(s) associated with a CIS or BIS identified by
 *        the Connection_Handle parameter.
 * @param Connection_Handle Connection handle of the CIS or BIS.
 *        Values:
 *        - 0x0000 ... 0x0EFF
 * @param Data_Path_Direction The Data_Path_Direction parameter specifies which
 *        directions are to have the data path removed.
 *        Flags:
 *        - 0x01: Input
 *        - 0x02: Output
 * @retval Value indicating success or error code.
 */
tBleStatus hci_le_remove_iso_data_path(uint16_t Connection_Handle,
                                       uint8_t Data_Path_Direction);
/**
 * @brief The HCI_LE_ISO_Transmit_Test command should only be used in the ISO
 *        Test mode and only for testing purposes. The command is used to
 *        configure an established CIS or BIS specified by the Connection_Handle
 *        parameter, and transmit test payloads which are generated by the
 *        Controller. When using this command for a CIS, the Host shall set up a
 *        CIG before invoking this command. When using this command for a BIS,
 *        the Host shall create the BIG before invoking this command. This
 *        command applies to all BISes in the BIG.
 * @param Connection_Handle Connection handle of the CIS or BIS.
 *        Values:
 *        - 0x0000 ... 0x0EFF
 * @param Payload_Type The Payload_Type parameter defines the configuration of
 *        SDUs in the payload.
 *        Values:
 *        - 0x00: ZERO_LENGTH_PAYLOAD
 *        - 0x01: VARIABLE_LENGTH_PAYLOAD
 *        - 0x02: MAXIMUM_LENGTH_PAYLOAD
 * @retval Value indicating success or error code.
 */
tBleStatus hci_le_iso_transmit_test(uint16_t Connection_Handle,
                                    uint8_t Payload_Type);
/**
 * @brief The HCI_LE_ISO_Receive_Test command should only be used in the ISO
 *        Test mode and only for testing purposes. The command is used to
 *        configure an established CIS or a synchronized BIG specified by the
 *        Connection_Handle parameter to receive payloads. When using this
 *        command for a BIS, the Host shall synchronize with a BIG using the
 *        HCI_LE_BIG_Create_Sync command before invoking this command.
 * @param Connection_Handle Connection handle of the CIS or BIS.
 *        Values:
 *        - 0x0000 ... 0x0EFF
 * @param Payload_Type The Payload_Type parameter defines the configuration of
 *        SDUs in the payload.
 *        Values:
 *        - 0x00: ZERO_LENGTH_PAYLOAD
 *        - 0x01: VARIABLE_LENGTH_PAYLOAD
 *        - 0x02: MAXIMUM_LENGTH_PAYLOAD
 * @retval Value indicating success or error code.
 */
tBleStatus hci_le_iso_receive_test(uint16_t Connection_Handle,
                                   uint8_t Payload_Type);
/**
 * @brief The HCI_LE_ISO_Read_Test_Counters command should only be used in the
 *        ISO Test mode and only for testing purposes. The command is used to
 *        read the test counters (see Core 5.2 [Vol 6] Part B, Section 7) in the
 *        Controller which is configured in ISO Receive Test mode for a CIS or
 *        BIS specified by the Connection_Handle. Reading the test counters does
 *        not reset the test counters.
 * @param Connection_Handle Connection handle of the CIS or BIS.
 *        Values:
 *        - 0x0000 ... 0x0EFF
 * @param[out] Received_Packet_Count Number in the Received_Packet_Count.
 * @param[out] Missed_Packet_Count Number in the Missed_Packet_Count.
 * @param[out] Failed_Packet_Count Number in the Failed_Packet_Count.
 * @retval Value indicating success or error code.
 */
tBleStatus hci_le_iso_read_test_counters(uint16_t Connection_Handle,
                                         uint32_t *Received_Packet_Count,
                                         uint32_t *Missed_Packet_Count,
                                         uint32_t *Failed_Packet_Count);
/**
 * @brief The HCI_LE_ISO_Test_End command should only be used in the ISO Test
 *        mode and only for testing purposes. The command is used to terminate
 *        the ISO Transmit and/or Receive Test mode for a CIS or BIS specified
 *        by the Connection_Handle parameter but does not terminate the CIS or
 *        BIS. When the Host terminates the ISO Test mode for a CIS or BIS that
 *        is set to ISO Transmit Test mode only, the test counters in the return
 *        parameters shall be set to zero. When the Host terminates the ISO Test
 *        mode for a CIS or BIS that is set to the ISO Receive Test mode, the
 *        return parameters contain the values of the test counters as defined
 *        in [Vol 6] Part B, Section 7.
 * @param Connection_Handle Connection handle of the CIS or BIS.
 *        Values:
 *        - 0x0000 ... 0x0EFF
 * @param[out] Received_Packet_Count Number in the Received_Packet_Count.
 * @param[out] Missed_Packet_Count Number in the Missed_Packet_Count.
 * @param[out] Failed_Packet_Count Number in the Failed_Packet_Count.
 * @retval Value indicating success or error code.
 */
tBleStatus hci_le_iso_test_end(uint16_t Connection_Handle,
                               uint32_t *Received_Packet_Count,
                               uint32_t *Missed_Packet_Count,
                               uint32_t *Failed_Packet_Count);
/**
 * @brief The HCI_LE_Set_Host_Feature command is used by the Host to set or
 *        clear a bit controlled by the Host in the Link Layer FeatureSet stored
 *        in the Controller (see [Vol 6] Part B, Section 4.6). The Bit_Number
 *        parameter specifies the bit position in the FeatureSet. The Bit_Value
 *        parameter specifies whether the feature is enabled or disabled. If
 *        Bit_Number specifies a feature bit that is not controlled by the Host,
 *        the Controller shall return the error code Unsupported Feature or
 *        Parameter Value (0x11). If Bit_Value is set to 0x01 and Bit_Number
 *        specifies a feature bit that requires support of a feature that the
 *        Controller does not support, the Controller shall return the error
 *        code Unsupported Feature or Parameter Value (0x11). If the Host issues
 *        this command while the Controller has a connection to another device,
 *        the Controller shall return the error code Command Disallowed (0x0C).
 * @param Bit_Number Bit position in the FeatureSet.
 *        Values:
 *        - 0x00 ... 0x3F
 * @param Bit_Value If 0, the Host feature is disabled, if 1 the Host feature is
 *        enablded.
 *        Values:
 *        - 0x00: DISABLED
 *        - 0x01: ENABLED
 * @retval Value indicating success or error code.
 */
tBleStatus hci_le_set_host_feature(uint8_t Bit_Number,
                                   uint8_t Bit_Value);
/**
 * @brief This command returns the values of various counters related to link
 *        quality that are associated with the isochronous stream specified by
 *        the Connection_Handle parameter. This command may be issued on both
 *        the central and peripheral if the connection handle identifies a CIS
 *        and on the Synchronized Receiver if the connection handle identifies a
 *        BIS.
 * @param Connection_Handle Connection handle of the CIS or BIS.
 *        Values:
 *        - 0x0000 ... 0x0EFF
 * @param[out] Tx_UnACKed_Packets Value of the Tx_UnACKed_Packets counter.
 *             Incremented when the Link Layer does not receive an
 *             acknowledgment for a CIS Data PDU that it transmitted at least
 *             once by its flush point (see Core 5.2 [Vol 6] Part B, Section
 *             4.5.13.5).
 * @param[out] Tx_Flushed_Packets Value of the Tx_Flushed_Packets counter.
 *             Incremented when the Link Layer does not transmit a specific
 *             payload by its flush point.
 * @param[out] Tx_Last_Subevent_Packets Value of the Tx_Last_Subevent_Packets
 *             counter. Incremented when the Link Layer transmits a CIS Data PDU
 *             in the last subevent of a CIS event.
 * @param[out] Retransmitted_Packets Value of the Retransmitted_Packets counter.
 *             Incremented when the Link Layer retransmits a CIS Data PDU.
 * @param[out] CRC_Error_Packets Value of the CRC_Error_Packets counter.
 *             Incremented when the Link Layer receives a packet with a CRC
 *             error.
 * @param[out] Rx_Unreceived_Packets Value of the Rx_Unreceived_Packets counter.
 *             Incremented when the Link Layer does not receive a specific
 *             payload by its flush point (on a CIS) or the end of the event it
 *             is associated with (on a BIS; see Core v5.2 [Vol 6] Part B,
 *             Section 4.4.6.6).
 * @param[out] Duplicate_Packets Value of the Duplicate_Packets counter.
 *             Incremented when the Link Layer receives a retransmission of a
 *             CIS Data PDU.
 * @retval Value indicating success or error code.
 */
tBleStatus hci_le_read_iso_link_quality(uint16_t Connection_Handle,
                                        uint32_t *Tx_UnACKed_Packets,
                                        uint32_t *Tx_Flushed_Packets,
                                        uint32_t *Tx_Last_Subevent_Packets,
                                        uint32_t *Retransmitted_Packets,
                                        uint32_t *CRC_Error_Packets,
                                        uint32_t *Rx_Unreceived_Packets,
                                        uint32_t *Duplicate_Packets);
/**
 * @brief Read the current and maximum transmit power levels of the local
