sheulisback/ble-demo-wb05kn1-nucleo-u545/firmware/Middlewares/ST/STM32WB05N/includes/stm32wb05n_hci_le.h
 *        Controller on the ACL connection identified by the Connection_Handle
 *        parameter and the PHY indicated by the PHY parameter.
 * @param Connection_Handle Connection handle that identifies the connection.
 *        Values:
 *        - 0x0000 ... 0x0EFF
 * @param PHY PHY associated with the connection  (not necessarily the currently
 *        used one).
 *        Values:
 *        - 0x01: LE_1M_PHY
 *        - 0x02: LE_2M_PHY
 *        - 0x03: LE_CODED_PHY_S8
 *        - 0x04: LE_CODED_PHY_S2
 * @param[out] Current_Transmit_Power_Level Current TX power level (dBm).
 *             Values:
 *             - -127 ... 20
 *             - 127: NA
 * @param[out] Max_Transmit_Power_Level Maximum TX power level (dBm).
 *             Values:
 *             - -127 ... 20
 * @retval Value indicating success or error code.
 */
tBleStatus hci_le_enhanced_read_transmit_power_level(uint16_t Connection_Handle,
                                                     uint8_t PHY,
                                                     int8_t *Current_Transmit_Power_Level,
                                                     int8_t *Max_Transmit_Power_Level);
/**
 * @brief Read the transmit power level used by the remote Controller on the ACL
 *        connection that is identified by the Connection_Handle parameter and
 *        the PHY indicated by the PHY parameter. Initiate a Power Control
 *        Request procedure to obtain the remote transmit power level if no
 *        prior value is available or used.
 * @param Connection_Handle Connection handle that identifies the connection.
 *        Values:
 *        - 0x0000 ... 0x0EFF
 * @param PHY PHY associated with the connection  (not necessarily the currently
 *        used one).
 *        Values:
 *        - 0x01: LE_1M_PHY
 *        - 0x02: LE_2M_PHY
 *        - 0x03: LE_CODED_PHY_S8
 *        - 0x04: LE_CODED_PHY_S2
 * @retval Value indicating success or error code.
 */
tBleStatus hci_le_read_remote_transmit_power_level(uint16_t Connection_Handle,
                                                   uint8_t PHY);
/**
 * @brief Set the path loss threshold reporting parameters for the ACL
 *        connection identified by the Connection_Handle parameter.
 * @param Connection_Handle Connection handle that identifies the connection.
 *        Values:
 *        - 0x0000 ... 0x0EFF
 * @param High_Threshold High threshold for the path loss. Units: dB.
 *        Values:
 *        - 0 ... 254
 *        - 255: UNUSED
 * @param High_Hysteresis Hysteresis value for the high threshold. Units: dB.
 * @param Low_Threshold Low threshold for the path loss. Units: dB.
 * @param Low_Hysteresis Hysteresis value for the low threshold. Units: dB.
 * @param Min_Time_Spent Minimum time in number of connection events to be
 *        observed once the path crosses the threshold before an event is
 *        generated.
 * @retval Value indicating success or error code.
 */
tBleStatus hci_le_set_path_loss_reporting_parameters(uint16_t Connection_Handle,
                                                     uint8_t High_Threshold,
                                                     uint8_t High_Hysteresis,
                                                     uint8_t Low_Threshold,
                                                     uint8_t Low_Hysteresis,
                                                     uint16_t Min_Time_Spent);
/**
 * @brief Enable or disable path loss reporting for the ACL connection
 *        identified by the Connection_Handle parameter. Initiate a new Power
 *        Control Request procedure to obtain the remote transmit power level if
 *        no prior value is available or used and no prior Power Control Request
 *        procedure has been initiated. Path loss reporting is disabled when the
 *        connection is first created.
 * @param Connection_Handle Connection handle that identifies the connection.
 *        Values:
 *        - 0x0000 ... 0x0EFF
 * @param Enable Enable (1) or disable (0) reportinig.
 *        Values:
 *        - 0x00: DISABLE
 *        - 0x01: ENABLE
 * @retval Value indicating success or error code.
 */
tBleStatus hci_le_set_path_loss_reporting_enable(uint16_t Connection_Handle,
                                                 uint8_t Enable);
/**
 * @brief Enable or disable the reporting of transmit power level changes in the
 *        local and remote Controllers for the ACL connection identified by the
 *        Connection_Handle parameter. Initiate a new Power Control Request
 *        procedure to obtain the remote transmit power level if Remote_Enable
 *        is 0x01, and no prior value is available or used, and no prior Power
 *        Control Request procedure has been initiated.
 * @param Connection_Handle Connection handle that identifies the connection.
 *        Values:
 *        - 0x0000 ... 0x0EFF
 * @param Local_Enable Enable (1) or disable (0) local transmit power reports.
 *        Values:
 *        - 0x00: DISABLE
 *        - 0x01: ENABLE
 * @param Remote_Enable Enable (1) or disable (0) remote transmit power reports.
 *        Values:
 *        - 0x00: DISABLE
 *        - 0x01: ENABLE
 * @retval Value indicating success or error code.
 */
tBleStatus hci_le_set_transmit_power_reporting_enable(uint16_t Connection_Handle,
                                                      uint8_t Local_Enable,
                                                      uint8_t Remote_Enable);
/**
 * @brief This command is used to start a test where the DUT generates test
 *        reference packets at a fixed interval. The Controller shall transmit
 *        at the power level indicated by the Transmit_Power_Level parameter.
 *        The TX_Channel and PHY parameters specify the RF channel and PHY to be
 *        used by the transmitter. If the Host sets the PHY parameter to a PHY
 *        that the Controller does not support, including a value that is
 *        reserved for future use, the Controller shall return the error code
 *        Unsupported Feature or Parameter Value (0x11). The Test_Data_Length
 *        and Packet_Payload parameters specify the length and contents of the
 *        Payload of the test reference packets. An LE Controller supporting the
 *        HCI_LE_Transmitter_Test command shall support Packet_Payload values
 *        0x00, 0x01 and 0x02. An LE Controller supporting the LE Coded PHY
 *        shall also support Packet_Payload value 0x04. An LE Controller may
 *        support other values of Packet_Payload. The CTE_Length and CTE_Type
 *        parameters specify the length and type of the Constant Tone Extension
 *        in the test reference packets. If the CTE_Type parameter is set to
 *        0x01 and the Controller does not support 1 microsecond switching, the
 *        Controller shall return the error code Unsupported Feature or
 *        Parameter Value (0x11). If CTE_Length is not zero and PHY specifies a
 *        PHY that does not allow Constant Tone Extensions, the Controller shall
 *        return the error code Command Disallowed (0x0C). The
 *        Switching_Pattern_Length and Antenna_IDs[i] parameters specify the
 *        antenna switching pattern. They are only used when transmitting an AoD
 *        Constant Tone Extension and shall be ignored when transmitting an AoA
 *        Constant Tone Extension. If the Controller determines that any of the
 *        Antenna_IDs[i] values do not identify an antenna in the device's
 *        antenna array, it shall return the error code Unsupported Feature or
 *        Parameter Value (0x11). Note: Some Controllers may be unable to
 *        determine which values do or do not identify an antenna. The
 *        Transmit_Power_Level parameter specifies the transmit power level to
 *        be used by the transmitter. If the parameter is set to a value other
 *        than 0x7E or 0x7F, then the Controller shall make the requested change
 *        or shall make the nearest change that it is capable of doing.
 * @param TX_Channel N = (F - 2402) / 2. Frequency Range : 2402 MHz to 2480 MHz
 *        Values:
 *        - 0x00 ... 0x27
 * @param Test_Data_Length Length in bytes of payload data in each packet.
 *        Supported ranges:       - (0x00,0x25) if data length extension is
 *        disabled.       - (0x00,0xFF) if data length extension is enabled.
 *        Values:
 *        - 0x00 ... 0xFF
 * @param Packet_Payload Content of the Payload of the test reference packets.
 *        0: PRBS9 sequence '11111111100000111101...' (in transmission order) 1:
 *        Repeated '11110000' (in transmission order) sequence 2: Repeated
 *        '10101010' (in transmission order) sequence 3: PRBS15 sequence 4:
 *        Repeated '11111111' (in transmission order) sequence 5: Repeated
 *        '00000000' (in transmission order) sequence 6: Repeated '00001111' (in
 *        transmission order) sequence 7: Repeated '01010101' (in transmission
 *        order) sequence
 *        Values:
 *        - 0x00: PRBS9
 *        - 0x01: Repeated '11110000'
 *        - 0x02: Repeated '10101010'
 *        - 0x03: PRBS15
 *        - 0x04: Repeated '11111111'
 *        - 0x05: Repeated '00000000'
 *        - 0x06: Repeated '00001111'
 *        - 0x07: Repeated '01010101'
 * @param PHY PHY to be used by the transmitter.
 *        Values:
 *        - 0x01: LE_1M_PHY
 *        - 0x02: LE_2M_PHY
 *        - 0x03: LE_CODED_PHY_S8
 *        - 0x04: LE_CODED_PHY_S2
 * @param CTE_Length
 *        Values:
 *        - 0x00: No Constant Tone Extension expected (default)
 *        - 0x02 ... 0x14: Expected length of the Constant Tone Extension in 8 microseconds units.
 * @param CTE_Type
 *        Values:
 *        - 0x00: Expect AoA Constant Tone Extension
 *        - 0x01: Expect AoD Constant Tone Extension with 1 microsecond slots
 *        - 0x02: Expect AoD Constant Tone Extension with 2 microseconds slots
 * @param Switching_Pattern_Length
 *        Values:
 *        - 0x02 ... 0x4B: The number of Antenna IDs in the pattern.
 * @param Antenna_IDs List of Antenna IDs in the pattern
 * @param Transmit_Power_Level
 *        Values:
 *        - -127 ... 20: Set transmitter to the specified or the nearest transmit power level.
 *        - 126: Set transmitter to minimum transmit power level
 *        - 127: Set transmitter to maximum transmit power level
 * @retval Value indicating success or error code.
 */
tBleStatus hci_le_transmitter_test_v4(uint8_t TX_Channel,
                                      uint8_t Test_Data_Length,
                                      uint8_t Packet_Payload,
                                      uint8_t PHY,
                                      uint8_t CTE_Length,
                                      uint8_t CTE_Type,
                                      uint8_t Switching_Pattern_Length,
                                      uint8_t Antenna_IDs[],
                                      int8_t Transmit_Power_Level);
/**
 * @brief The HCI_LE_Set_Data_Related_Address_Changes command specifies
 *        circumstances when the Controller shall refresh any Resolvable Private
 *        Address used by the advertising set identified by the
 *        Advertising_Handle parameter, whether or not the address timeout
 *        period has been reached. This command may be used while advertising is
 *        enabled. The Change_Reasons parameter specifies the reason(s) for
 *        refreshing addresses. The default when an advertising set is created,
 *        or if legacy advertising commands (see Section 3.1.1) are used, is for
 *        all bits to be clear. If extended advertising commands (see Section
 *        3.1.1) are being used and the advertising set corresponding to the
 *        Advertising_Handle parameter does not exist, or if no command
 *        specified in Table 3.2 has been used, then the Controller shall return
 *        the error code Unknown Advertising Identifier (0x42). If legacy
 *        advertising commands are being used, the Controller shall ignore the
 *        Advertising_Handle parameter.
 * @param Advertising_Handle Used to identify an advertising set.
 *        Values:
 *        - 0x00 ... 0xEF
 * @param Change_Reasons Bitmap associated with the reasons to refresh the
 *        Resolvable Private Addresses used by the advertising set. If bit 0 is
 *        set, change the address whenever the advertising data changes. If bit
 *        1 is set, change the address whenever the scan response data changes.
 *        Flags:
 *        - 0x01: ADV_DATA_CHANGES
 *        - 0x02: SCAN_RESP_DATA_CHANGES
 * @retval Value indicating success or error code.
 */
tBleStatus hci_le_set_data_related_address_changes(uint8_t Advertising_Handle,
                                                   uint8_t Change_Reasons);
/**
 * @brief The HCI_LE_Set_Default_Subrate command is used by the Host to set the
 *        initial values for the acceptable parameters for subrating requests,
 *        as defined by the HCI_LE Subrate_Request command, for all future ACL
 *        connections where the Controller is the Central. This command does not
 *        affect any existing connection. The parameters have the same meanings
 *        and restrictions as those in the HCI_LE_Subrate_Request command.
 * @param Subrate_Min Minimum subrate factor allowed in requests by a
 *        Peripheral.
 *        Values:
 *        - 0x0001 ... 0x01F4
 * @param Subrate_Max Maximum subrate factor allowed in requests by a
 *        Peripheral.
 *        Values:
 *        - 0x0001 ... 0x01F4
 * @param Max_Latency Maximum Peripheral latency allowed in requests by a
 *        Peripheral, in units of subrated connection intervals.
 *        Values:
 *        - 0x0000 ... 0x01F3
 * @param Continuation_Number Minimum number of underlying connection events to
 *        remain active after a packet containing a Link Layer PDU with a non-
 *        zero Length field is sent or received in requests by a Peripheral.
 *        Values:
 *        - 0x0000 ... 0x01F3
 * @param Supervision_Timeout Maximum supervision timeout allowed in requests by
 *        a Peripheral. Time = N x 10 ms.
 *        Values:
 *        - 0x000A (100 ms)  ... 0x0C80 (32000 ms) 
 * @retval Value indicating success or error code.
 */
tBleStatus hci_le_set_default_subrate(uint16_t Subrate_Min,
                                      uint16_t Subrate_Max,
                                      uint16_t Max_Latency,
                                      uint16_t Continuation_Number,
                                      uint16_t Supervision_Timeout);
/**
 * @brief The HCI_LE_Subrate_Request command is used by a Central or a
 *        Peripheral to request a change to the subrating factor and/or other
 *        parameters (see Core Vol 6 Part B, Section 4.5.1) applied to an
 *        existing connection using the Connection Subrate Update procedure. The
 *        Subrate_Min and Subrate_Max parameters specify the range of acceptable
 *        subrating factors being requested. The Max_Latency parameter specifies
 *        the maximum Peripheral latency in units of subrated connection events.
 *        The same maximum shall apply irrespective of the subrating factor
 *        actually chosen. The Continuation_Number parameter specifies the
 *        number of underlying connection intervals to remain active after a
 *        packet (other than an empty packet) is transmitted or received. The
 *        Supervision_Timeout parameter specifies the link supervision timeout
 *        for the connection. The Supervision_Timeout, in milliseconds, shall be
 *        greater than 2 x current connection interval x Subrate_Max x
 *        (Max_Latency + 1). If this command is issued on the Central, the
 *        following rules shall apply when the Controller initiates the
 *        Connection Subrate Update procedure (see Core Vol 6 Part B, Section
 *        5.1.19): * The Peripheral latency shall be less than or equal to
 *        Max_Latency. * The subrate factor shall be between Subrate_Min and
 *        Subrate_Max. * The continuation number shall be equal to the lesser of
 *        Continuation_- Number and (subrate factor - 1). * The connection
 *        supervision timeout shall be equal to Supervision_Timeout. If this
 *        command is issued on the Central, it also sets the acceptable
 *        parameters for requests from the Peripheral (see Core Vol 6 Part B,
 *        Section 5.1.20). The acceptable parameters set by this command
 *        override those provided via the HCI_LE_Set_Default_Subrate command or
 *        any values set by previous uses of this command on the same
 *        connection.  If this command is issued on the Peripheral, the
 *        following rules shall apply when the Controller initiates the
 *        Connection Subrate Request procedure: * The Peripheral latency shall
 *        be less than or equal to Max_Latency. * The minimum and maximum
 *        subrate factors shall be between Subrate_Min and Subrate_Max. * The
 *        continuation number shall be equal to the lesser of
 *        Continuation_Number and (maximum subrate factor - 1). * The connection
 *        supervision timeout shall be equal to Supervision_Timeout. If the
 *        Connection_Handle parameter does not identify a current ACL
 *        connection, the Controller shall return the error code Unknown
 *        Connection Identifier (0x02). If the Host issues this command with
 *        parameters such that Subrate_Max x (Max_Latency + 1) is greater than
 *        500 or the current connection interval x Subrate_ Max x (Max_Latency +
 *        1) is greater than or equal to half the Supervision_ Timeout
 *        parameter, the Controller shall return the error code Invalid HCI
 *        Command Parameters (0x12). If the Host issues this command with
 *        Subrate_Max less than Subrate_Min, the Controller shall return the
 *        error code Invalid HCI Command Parameters (0x12). If the Host issues
 *        this command with Continuation_Number greater than or equal to
 *        Subrate_Max, then the Controller shall return the error code Invalid
 *        HCI Command Parameters (0x12). If the Central's Host issues this
 *        command when the Connection Subrating (Host Support) bit is not set in
 *        the Peripheral's FeatureSet, the Controller shall return the error
 *        code Unsupported Remote Feature (0x1A).
 * @param Connection_Handle Connection handle of the ACL.
 *        Values:
 *        - 0x0000 ... 0x0EFF
 * @param Subrate_Min Minimum subrate factor to be applied to the underlying
 *        connection interval.
 *        Values:
 *        - 0x0001 ... 0x01F4
 * @param Subrate_Max Maximum subrate factor to be applied to the underlying
 *        connection interval.
 *        Values:
 *        - 0x0001 ... 0x01F4
 * @param Max_Latency Maximum Peripheral latency for the connection in units of
 *        subrated connection intervals.
 *        Values:
 *        - 0x0000 ... 0x01F3
 * @param Continuation_Number Minimum number of underlying connection events to
 *        remain active after a packet containing a Link Layer PDU with a non-
 *        zero Length field is sent or received.
 *        Values:
 *        - 0x0000 ... 0x01F3
 * @param Supervision_Timeout Supervision timeout for this connection. Time = N
 *        x 10 ms.
 *        Values:
 *        - 0x000A (100 ms)  ... 0x0C80 (32000 ms) 
 * @retval Value indicating success or error code.
 */
tBleStatus hci_le_subrate_request(uint16_t Connection_Handle,
                                  uint16_t Subrate_Min,
                                  uint16_t Subrate_Max,
                                  uint16_t Max_Latency,
                                  uint16_t Continuation_Number,
                                  uint16_t Supervision_Timeout);
/**
 * @brief The LE_Set_Extended_Advertising_Parameters command is used by the Host
 *        to set the advertising parameters. The Advertising_Handle parameter
 *        identifies the advertising set whose parameters are being configured.
 *        The Advertising_Event_Properties parameter describes the type of
 *        advertising event that is being configured and its basic properties.
 *        The type shall be one supported by the Controller.
 * @param Advertising_Handle The Advertising_Handle parameter identifies the
 *        advertising set whose parameters are being configured.
 *        Values:
 *        - 0x00 ... 0xEF
 * @param Advertising_Event_Properties The Advertising_Event_Properties
 *        parameter describes the type of advertising event that is being
 *        configured and its basic properties. The type shall be one supported
 *        by the Controller. Bits: 0 Connectable advertising 1 Scannable
 *        advertising 2 Directed advertising 3 High Duty Cycle Directed
 *        Connectable advertising (<= 3.75 ms Advertising Interval) 4 Use legacy
 *        advertising PDUs 5 Omit advertiser's address from all PDUs ("anonymous
 *        advertising") 6 Include TxPower in the extended header of the
 *        advertising PDU
 *        Flags:
 *        - 0x0001: Connectable
 *        - 0x0002: Scannable
 *        - 0x0004: Directed
 *        - 0x0008: HDC Directed Connectable
 *        - 0x0010: Legacy
 *        - 0x0020: Anonymous
 *        - 0x0040: TxPower in ext header
 * @param Primary_Advertising_Interval_Min Minimum advertising interval for
 *        undirected and low duty cycle directed advertising. Time = N * 0.625
 *        ms; Time Range: 20 ms to 10,485.759375 s.
 *        Values:
 *        - 0x000020 (20.000 ms)  ... 0xFFFFFF (10485759.375 ms) 
 * @param Primary_Advertising_Interval_Max Maximum advertising interval for
 *        undirected and low duty cycle directed advertising. Time = N * 0.625
 *        ms; Time Range: 20 ms to 10,485.759375 s.
 *        Values:
 *        - 0x000020 (20.000 ms)  ... 0xFFFFFF (10485759.375 ms) 
 * @param Primary_Advertising_Channel_Map The Primary_Advertising_Channel_Map is
 *        a bit field that indicates the advertising channels that shall be used
 *        when transmitting advertising packets. At least one channel bit shall
 *        be set in the Primary_Advertising_Channel_Map parameter.
 *        Flags:
 *        - 0x01: CH_37
 *        - 0x02: CH_38
 *        - 0x04: CH_39
 * @param Own_Address_Type The Own_Address_Type parameter specifies the type of
 *        address being used in the advertising packets. For random addresses,
 *        the address is specified by the LE_Set_Advertising_Set_Random_Address
 *        command.  0x00 Public Device Address 0x01 Random Device Address 0x02
 *        Controller generates the Resolvable Private Address based on the local
 *        IRK from the resolving list. If the resolving list contains no
 *        matching entry, use the public address. 0x03 Controller generates the
 *        Resolvable Private Address based on the local IRK from the resolving
 *        list. If the resolving list contains no matching entry, use the random
 *        address from LE_Set_Advertising_Set_Random_Address. All other values
 *        Reserved for future use
 *        Values:
 *        - 0x00: Public Device Address
 *        - 0x01: Random Device Address
 *        - 0x02: Resolvable Private Address / Public Address
 *        - 0x03: Resolvable Private Address / Random Address
 * @param Peer_Address_Type Peer Address type
 *        Values:
 *        - 0x00: Public Device Address or Public Identity Address
 *        - 0x01: Random Device Address or Random (static) Identity Address
 * @param Peer_Address Public Device Address, Random Device Address, Public
 *        Identity Address, or Random (static) Identity Address of the device to
 *        be connected.
 * @param Advertising_Filter_Policy Advertising Filter Policy. This parameter is
