sheulisback/ble-demo-wb05kn1-nucleo-u545/firmware/Middlewares/ST/STM32WB05N/includes/stm32wb05n_hci_le.h
 *        ignored when directed advertising is enabled.  0x00 Process scan and
 *        connection requests from all devices (i.e., the Filter Accept List is
 *        not in use) 0x01 Process connection requests from all devices and scan
 *        requests only from devices that are in the Filter Accept List 0x02
 *        Process scan requests from all devices and connection requests only
 *        from devices that are in the Filter Accept List. 0x03 Process scan and
 *        connection requests only from devices in the Filter Accept List. All
 *        other values are reserved for future use
 *        Values:
 *        - 0x00: HCI_ADV_FILTER_NONE
 *        - 0x01: HCI_ADV_FILTER_ACCEPT_LIST_SCAN
 *        - 0x02: HCI_ADV_FILTER_ACCEPT_LIST_CONNECT
 *        - 0x03: HCI_ADV_FILTER_ACCEPT_LIST_SCAN_CONNECT
 * @param Advertising_Tx_Power Units: dBm  The Advertising_Tx_Power parameter
 *        indicates the maximum power level at which the advertising packets are
 *        to be transmitted on the advertising channels. The Controller shall
 *        choose a power level lower than or equal to the one specified by the
 *        Host.
 *        Values:
 *        - -127 ... 126
 *        - 127: No preference
 * @param Primary_Advertising_PHY The Primary_Advertising_PHY parameter
 *        indicates the PHY on which the advertising packets are transmitted on
 *        the primary advertising channel. If legacy advertising PDUs are being
 *        used, the Primary_Advertising_PHY shall indicate the LE 1M PHY.
 *        Values:
 *        - 0x01: LE_1M_PHY
 *        - 0x03: LE_CODED_PHY
 * @param Secondary_Advertising_Max_Skip The Secondary_Advertising_Max_Skip
 *        parameter is the maximum number of advertising events that can be
 *        skipped before the AUX_ADV_IND can be sent. 0x00 AUX_ADV_IND shall be
 *        sent prior to the next advertising event 0x01-0xFF Maximum advertising
 *        events the Controller can skip before sending the AUX_ADV_IND packets
 *        on the secondary advertising channel
 *        Values:
 *        - 0x00 ... 0xFF
 * @param Secondary_Advertising_PHY The Secondary_Advertising_PHY parameter
 *        indicates the PHY on which the advertising packets are transmitted on
 *        the secondary advertising channel.
 *        Values:
 *        - 0x01: LE_1M_PHY
 *        - 0x02: LE_2M_PHY
 *        - 0x03: LE_CODED_PHY
 * @param Advertising_SID The Advertising_SID parameter specifies the value to
 *        be transmitted in the Advertising SID subfield of the ADI field of the
 *        Extended Header of those advertising channel PDUs that have an ADI
 *        field. If the advertising set only uses PDUs that do not contain an
 *        ADI field, Advertising_SID is ignored.
 *        Values:
 *        - 0x00 ... 0x0F
 * @param Scan_Request_Notification_Enable The Scan_Request_Notification_Enable
 *        parameter indicates whether the Controller shall send notifications
 *        upon the receipt of a scan request PDU that is in response to an
 *        advertisement from the specified advertising set that contains its
 *        device address and is from a scanner that is allowed by the
 *        advertising filter policy.
 *        Values:
 *        - 0x00: Scan request notifications disabled
 *        - 0x01: Scan request notifications enabled
 * @param Primary_Advertising_PHY_Options Preference or requirements on coding
 *        scheme when transmitting on Primary Advertising Physical Channel.
 *        Values:
 *        - 0x00: CODED_PHY_NO_PREFERENCE
 *        - 0x01: CODED_PHY_S2_PREFERRED
 *        - 0x02: CODED_PHY_S8_PREFERRED
 *        - 0x03: CODED_PHY_S2_REQUIRED
 *        - 0x04: CODED_PHY_S8_REQUIRED
 * @param Secondary_Advertising_PHY_Options Preference or requirements on coding
 *        scheme when transmitting on Secondary Advertising Physical Channel.
 *        Values:
 *        - 0x00: CODED_PHY_NO_PREFERENCE
 *        - 0x01: CODED_PHY_S2_PREFERRED
 *        - 0x02: CODED_PHY_S8_PREFERRED
 *        - 0x03: CODED_PHY_S2_REQUIRED
 *        - 0x04: CODED_PHY_S8_REQUIRED
 * @param[out] Selected_Tx_Power Units: dBm. The Selected_Tx_Power return
 *             parameter indicates the transmit power selected by the
 *             Controller. The Controller shall not change the transmit power
 *             for this advertising set without being directed to by the Host.
 *             Values:
 *             - -127 ... 126
 * @retval Value indicating success or error code.
 */
tBleStatus hci_le_set_extended_advertising_parameters_v2(uint8_t Advertising_Handle,
                                                         uint16_t Advertising_Event_Properties,
                                                         uint8_t Primary_Advertising_Interval_Min[3],
                                                         uint8_t Primary_Advertising_Interval_Max[3],
                                                         uint8_t Primary_Advertising_Channel_Map,
                                                         uint8_t Own_Address_Type,
                                                         uint8_t Peer_Address_Type,
                                                         uint8_t Peer_Address[6],
                                                         uint8_t Advertising_Filter_Policy,
                                                         int8_t Advertising_Tx_Power,
                                                         uint8_t Primary_Advertising_PHY,
                                                         uint8_t Secondary_Advertising_Max_Skip,
                                                         uint8_t Secondary_Advertising_PHY,
                                                         uint8_t Advertising_SID,
                                                         uint8_t Scan_Request_Notification_Enable,
                                                         uint8_t Primary_Advertising_PHY_Options,
                                                         uint8_t Secondary_Advertising_PHY_Options,
                                                         int8_t *Selected_Tx_Power);
/**
 * @brief The HCI_LE_Set_Periodic_Advertising_Subevent_Data command is used by
 *        the Host to set the data for one or more subevents of PAwR in reply to
 *        an HCI_LE_Periodic_Advertising_Subevent_Data_Request event. The data
 *        for a subevent shall be transmitted only once. The Advertising_Handle
 *        parameter identifies the advertising set whose periodic advertising
 *        subevent data is being set. If the corresponding advertising set does
 *        not already exist, then the Controller shall return the error code
 *        Unknown Advertising Identifier (0x42). The Num_Subevents parameter is
 *        the number of subevent data contained in the parameter arrays. The
 *        Subevent arrayed parameter identifies the subevent of the PAwR that is
 *        being set. If the Host provides a subevent value that is outside of
 *        the range of subevents requested using the
 *        HCI_LE_Periodic_Advertising_Subevent_Data_Request event, then the
 *        Controller shall return the error code Command Disallowed (0x0C). The
 *        Response_Slot_Start and Response_Slot_Count arrayed parameters
 *        identify the starting response slot and the number of response slots
 *        that are expected to be used in this subevent. The
 *        Subevent_Data_Length arrayed parameter determines the length of the
 *        Subevent_Data that is significant. The Subevent_Data arrayed parameter
 *        contains the advertising data to be transmitted in the subevent of the
 *        advertising set. If the combined data length is greater than the
 *        maximum that the Controller can transmit within the current subevent
 *        interval, then all data shall be discarded and the Controller shall
 *        return the error code Packet Too Long (0x45). If advertising on the LE
 *        Coded PHY, then the S=8 coding shall be assumed unless the current
 *        advertising parameters require the use of S=2 for an advertising
 *        physical channel, in which case the S=2 coding shall be assumed for
 *        that advertising physical channel. If the Subevent_Data cannot be
 *        transmitted because, for example, the subevent where this data would
 *        have been sent has already passed or is too early, then the Controller
 *        shall return the error code Too Late (0x46) or Too Early (0x47) and
 *        discard the data.
 * @param Advertising_Handle It is used to identify an advertising set
 *        Values:
 *        - 0x00 ... 0xEF: Used to identify an advertising set
 * @param Num_Subevents Number of subevent data in the command.
 *        Values:
 *        - 0x01 ... 0x0F
 * @param Subevent_Data_Parameters See @ref Subevent_Data_Parameters_t
 * @retval Value indicating success or error code.
 */
tBleStatus hci_le_set_periodic_advertising_subevent_data(uint8_t Advertising_Handle,
                                                         uint8_t Num_Subevents,
                                                         Subevent_Data_Parameters_t Subevent_Data_Parameters[]);
/**
 * @brief The HCI_LE_Set_Periodic_Advertising_Response_Data command is used by
 *        the Host to set the data for a response slot in a specific subevent of
 *        the PAwR identified by the Sync_Handle. The data for a response slot
 *        shall be transmitted only once. The Request_Event parameter identifies
 *        the periodic advertising event in which the periodic advertising
 *        packet that the Host is responding to was received. The
 *        Request_Subevent parameter identifies the subevent in which the
 *        periodic advertising packet that the Host is responding to was
 *        received. The Response_Subevent parameter identifies the subevent that
 *        the response shall be sent in. The Response_Slot parameter identifies
 *        the response slot in the subevent identified by the Response_Subevent
 *        parameter in which this response data is to be transmitted. The
 *        Response_Data_Length specifies the length of the Response_Data that is
 *        significant. The Response_Data contains the advertising data to be
 *        transmitted in the response slot. If the Response_Data_Length is
 *        greater than the maximum that the Controller can transmit within the
 *        response slot, then the Response_Data shall be discarded and the
 *        Controller shall return the error code Packet Too Long (0x45). If
 *        advertising on the LE Coded PHY, then the S=8 coding shall be assumed
 *        unless the current advertising parameters require the use of S=2 for
 *        an advertising physical channel, in which case the S=2 coding shall be
 *        assumed for that advertising physical channel. If the response slot
 *        identified by the Response_Slot parameter has passed by the time this
 *        command is received by the Controller, the Controller shall return the
 *        error code Too Late (0x46) and discard the Response_Data parameter.
 * @param Sync_Handle Sync_Handle identifying the PAwR train.
 *        Values:
 *        - 0x0000 ... 0x0EFF
 * @param Request_Event The value of paEventCounter (see [Vol 6] Part B, Section
 *        4.4.2.1) for the periodic advertising packet that the Host is
 *        responding to.
 * @param Request_Subevent Used to identify the subevent of the PAwR train.
 *        Values:
 *        - 0x00 ... 0x7F
 * @param Response_Subevent Used to identify the response slot of the PAwR
 *        train.
 * @param Response_Slot Used to identify the response slot of the PAwR train.
 * @param Response_Data_Length The number of octets in the Response_Data
 *        parameter.
 *        Values:
 *        - 0x00 ... 0xFB
 * @param Response_Data Response data formatted as defined in [Vol 3] Part C,
 *        Section 11.
 * @retval Value indicating success or error code.
 */
tBleStatus hci_le_set_periodic_advertising_response_data(uint16_t Sync_Handle,
                                                         uint16_t Request_Event,
                                                         uint8_t Request_Subevent,
                                                         uint8_t Response_Subevent,
                                                         uint8_t Response_Slot,
                                                         uint8_t Response_Data_Length,
                                                         uint8_t Response_Data[]);
/**
 * @brief The HCI_LE_Set_Periodic_Sync_Subevent command is used to instruct the
 *        Controller to synchronize with a subset of the subevents within a PAwR
 *        train identified by the Sync_Handle parameter, listen for packets sent
 *        by the peer device and pass any received data up to the Host. If the
 *        Controller is synchronized with any subevents that are not in the
 *        subset of subevents in this command, then the Controller shall no
 *        longer synchronize with those subevents. The
 *        Periodic_Advertising_Properties parameter indicates which fields
 *        should be included in the AUX_SYNC_SUBEVENT_RSP PDUs. The
 *        Num_Subevents parameter identifies the number of values in the
 *        subevents parameter. The Subevents arrayed parameter identifies the
 *        subevents that the Controller shall synchronize with.
 * @param Sync_Handle Sync_Handle identifying the PAwR train.
 *        Values:
 *        - 0x0000 ... 0x0EFF
 * @param Periodic_Advertising_Properties If bit 6 is set, include TxPower in
 *        the advertising PDU.
 *        Flags:
 *        - 0x0040: TX_POWER
 * @param Num_Subevents Number of subevent data in the command.
 *        Values:
 *        - 0x01 ... 0x0F
 * @param Subevent The subevent to synchronize with.
 * @retval Value indicating success or error code.
 */
tBleStatus hci_le_set_periodic_sync_subevent(uint16_t Sync_Handle,
                                             uint16_t Periodic_Advertising_Properties,
                                             uint8_t Num_Subevents,
                                             uint8_t Subevent[]);
/**
 * @brief The LE_Extended_Create_Connection command is used to create a Link
 *        Layer connection to a connectable advertiser.
 *        LE_Extended_Create_Connection command can be used in place of
 *        LE_Create_Connection command.
 * @param Advertising_Handle Advertising_Handle identifying the periodic
 *        advertising train.
 *        Values:
 *        - 0x00 ... 0xEF
 *        - 0xFF: Not specified
 * @param Subevent Subevent where the connection request is to be sent.
 *        Values:
 *        - 0x00 ... 0x7F
 *        - 0xFF: Not specified
 * @param Initiator_Filter_Policy The Initiator_Filter_Policy parameter is used
 *        to determine whether the Filter Accept List is used. If the Filter
 *        Accept List is not used, the Peer_Address_Type and the Peer_Address
 *        parameters specify the address type and address of the advertising
 *        device to connect to. 0x00 - Filter Accept List is not used to
 *        determine which advertiser to connect to. Peer_Address_Type and
 *        Peer_Address shall be used. 0x01 - Filter Accept List is used to
 *        determine which advertiser to connect to. Peer_Address_Type and
 *        Peer_Address shall be ignored.
 *        Values:
 *        - 0x00: FILTER_ACCEPT_LIST_NOT_USED
 *        - 0x01: FILTER_ACCEPT_LIST_USED
 * @param Own_Address_Type The Own_Address_Type parameter indicates the type of
 *        address being used in the connection request packets.
 *        Values:
 *        - 0x00: Public Device Address
 *        - 0x01: Random Device Address
 *        - 0x02: Controller generates the Resolvable Private Address based on the local
IRK from the resolving list. If the resolving list contains no matching
entry, then use the public address.
 *        - 0x03: Controller generates the Resolvable Private Address based on the local
IRK from the resolving list. If the resolving list contains no matching
entry, then use the random address from the most recent successful
LE_Set_Random_Address Command.
 * @param Peer_Address_Type The Peer_Address_Type parameter indicates the type
 *        of address used in the connectable advertisement sent by the peer.
 *        0x00: Public Device Address or Public Identity Address 0x01: Random
 *        Device Address or Random (static) Identity Address
 *        Values:
 *        - 0x00: Public Address
 *        - 0x01: Random Address
 * @param Peer_Address Public Device Address, Random Device Address, Public
 *        Identity Address, or Random (static) Identity Address of the device to
 *        be connected.
 * @param Initiating_PHYs The Initiating_PHYs parameter indicates the PHY(s) on
 *        which the advertising packets should be received on the primary
 *        advertising channel and the PHYs for which connection parameters have
 *        been specified. The Host may enable one or more initiating PHYs. 0x01:
 *        Scan connectable advertisements on the LE 1M PHY. Connection
 *        parameters for the LE 1M PHY are provided. 0x02: Connection parameters
 *        for the LE 2M PHY are provided 0x04: Scan connectable advertisements
 *        on the LE Coded PHY. Connection parameters for the LE Coded PHY are
 *        provided.
 *        Flags:
 *        - 0x01: LE_1M_PHY_BIT
 *        - 0x02: LE_2M_PHY_BIT
 *        - 0x04: LE_CODED_PHY_BIT
 * @param Extended_Create_Connection_Parameters See @ref
 *        Extended_Create_Connection_Parameters_t
 * @retval Value indicating success or error code.
 */
tBleStatus hci_le_extended_create_connection_v2(uint8_t Advertising_Handle,
                                                uint8_t Subevent,
                                                uint8_t Initiator_Filter_Policy,
                                                uint8_t Own_Address_Type,
                                                uint8_t Peer_Address_Type,
                                                uint8_t Peer_Address[6],
                                                uint8_t Initiating_PHYs,
                                                Extended_Create_Connection_Parameters_t Extended_Create_Connection_Parameters[]);
/**
 * @brief The HCI_LE_Set_Periodic_Advertising_Parameters command is used by the
 *        Host to set the parameters for periodic advertising. The
 *        Advertising_Handle parameter identifies the advertising set whose
 *        periodic advertising parameters are being configured. If the
 *        corresponding advertising set does not already exist, then the
 *        Controller shall return the error code Unknown Advertising Identifier
 *        (0x42). The Periodic_Advertising_Interval_Min parameter shall be less
 *        than or equal to the Periodic_Advertising_Interval_Max parameter. The
 *        Periodic_Advertising_- Interval_Min and
 *        Periodic_Advertising_Interval_Max parameters should not be the same
 *        value to enable the Controller to determine the best advertising
 *        interval given other activities. If the periodic advertising interval
 *        range provided by the Host (Periodic_Advertising_Interval_Min,
 *        Periodic_Advertising_Interval_Max) does not overlap with the periodic
 *        advertising interval range supported by the Controller, then the
 *        Controller shall return an error which should use the error code
 *        Unsupported Feature or Parameter Value (0x11). The
 *        Periodic_Advertising_Properties parameter indicates which fields
 *        should be included in the advertising packet. The Num_Subevents
 *        parameter identifies the number of subevents that shall be transmitted
 *        for each periodic advertising event. If the Num_Subevents parameter
 *        value is 0x00, then the Subevent_Interval, Response_Slot_Delay,
 *        Response_Slot_Spacing, and Num_Response_Slots parameters shall be
 *        ignored. The Subevent_Interval parameter identifies the time between
 *        the subevents of PAwR. The Subevent_Interval shall be less than or
 *        equal to the Periodic_Advertising_Interval_Min divided by the
 *        Num_Subevents of the advertising set. The Response_Slot_Delay
 *        parameter identifies the time between the start of the advertising
 *        packet at the start of a subevent and the start of the first response
 *        slot. The Response_Slot_Delay shall be less than the
 *        Subevent_Interval. The Response_Slot_Spacing parameter identifies the
 *        time between the start of two consecutive response slots. The
 *        Response_Slot_Spacing shall be less than or equal to 10 x
 *        (Subevent_Interval - Response_Slot_Delay) / Num_Response_Slots. If the
 *        Num_Response_Slots parameter is set to 1, then the Controller shall
 *        ignore the Response_Slot_Spacing parameter. The Num_Response_Slots
 *        parameter identifies the number of response slots in a subevent. If
 *        the Num_Response_Slots parameter value is 0x00, then the
 *        Response_Slot_Delay and Response_Slot_Spacing parameters shall be
 *        ignored. If the advertising set identified by the Advertising_Handle
 *        specified scannable, connectable, legacy, or anonymous advertising,
 *        the Controller shall return the error code Invalid HCI Command
 *        Parameters (0x12). If the Host issues this command when periodic
 *        advertising is enabled for the specified advertising set, the
 *        Controller shall return the error code Command Disallowed (0x0C). If
 *        the Advertising_Handle does not identify an advertising set that is
 *        already configured for periodic advertising and the Controller is
 *        unable to support more periodic advertising at present, the Controller
 *        shall return the error code Memory Capacity Exceeded (0x07). If the
 *        advertising set already contains periodic advertising data and the
 *        length of the data is greater than the maximum that the Controller can
 *        transmit within a periodic advertising interval of
 *        Periodic_Advertising_Interval_Max, the Controller shall return the
 *        error code Packet Too Long (0x45). If advertising on the LE Coded PHY,
 *        the S=8 coding shall be assumed unless the current advertising
 *        parameters require the use of S=2 for an advertising physical channel,
 *        in which case the S=2 coding shall be assumed for that advertising
 *        physical channel.
 * @param Advertising_Handle Used to identify a periodic advertising train.
 *        Values:
 *        - 0x00 ... 0xEF
 * @param Periodic_Advertising_Interval_Min Minimum advertising interval for
 *        periodic advertising. Time = N * 1.25 ms; Time Range: 7.5ms to
 *        81.91875 s.
 *        Values:
 *        - 0x0006 (7.50 ms)  ... 0xFFFF (NaN) 
 * @param Periodic_Advertising_Interval_Max Maximum advertising interval for
 *        periodic advertising. Time = N * 1.25 ms; Time Range: 7.5ms to
 *        81.91875 s.
 *        Values:
 *        - 0x0006 (7.50 ms)  ... 0xFFFF (NaN) 
 * @param Periodic_Advertising_Properties The Periodic_Advertising_Properties
 *        parameter indicates which fields should be included in the advertising
 *        packet.
 *        Flags:
 *        - 0x0040
 * @param Num_Subevents Number of subevents.
 *        Values:
 *        - 0x00 ... 0x80
 * @param Subevent_Interval Interval between subevents. Time = N x 1.25 ms.
 *        Values:
 *        - 0x06 (7.50 ms)  ... 0xFF (318.75 ms) 
 * @param Response_Slot_Delay Time between the advertising packet in a subevent
 *        and the first response slot. Time = N x 1.25 ms.
 *        Values:
 *        - 0x00 (NaN) : No response slots
 *        - 0x01 (1.25 ms)  ... 0xFE (317.50 ms) 
 * @param Response_Slot_Spacing Time between response slots. Time = N x 0.125 ms
 *        Values:
 *        - 0x00 (0.000 ms) : No response slots
 *        - 0x02 (0.250 ms)  ... 0xFF (31.875 ms) 
 * @param Num_Response_Slots Number of subevent response slots.
 *        Values:
 *        - 0x00 ... 0xFF
 * @retval Value indicating success or error code.
 */
tBleStatus hci_le_set_periodic_advertising_parameters_v2(uint8_t Advertising_Handle,
                                                         uint16_t Periodic_Advertising_Interval_Min,
                                                         uint16_t Periodic_Advertising_Interval_Max,
                                                         uint16_t Periodic_Advertising_Properties,
                                                         uint8_t Num_Subevents,
                                                         uint8_t Subevent_Interval,
                                                         uint8_t Response_Slot_Delay,
                                                         uint8_t Response_Slot_Spacing,
                                                         uint8_t Num_Response_Slots);
/**
     * @}
     */
    #endif /* _STM32WB05N_HCI_LE_H_ */
